[
    {
        "postTime": "2024-06-25 13:14:26",
        "content": "Things we learned after successfully delivering and launching 12+ AI products 👇🏻\n\n1/ There are way more use cases of AI than building a simple chatbot 🤖 Think outside the box. People are tired of chatbots.\n\n2/ AI is a feature, and it shouldn't be your key selling point anymore 💸 Everyone has jumped into AI and your product really has to solve a problem to survive\n\n3/ The barrier to entry is almost non-existent. The only limitation is your laziness to get started 💤\n\n4/ You can solve a problem really well if you have faced that yourself. If you are looking for ideas, get yourself in situations where you can encounter problems ⛑️\n\n5/ Boring ideas are the best. Use AI to solve problems of boring businesses and you have a profitable product 💡\n\n6/ Your AI product should not take months and months to launch. AI is rapidly changing and if your product is not out in the open soon enough, it might face the fate of dinosaurs 🦖 🎇\n\nWe've built AI products used by thousands daily (developed in weeks!), and some that flopped (developed in months). The difference? Execution ✨",
        "date": "22h • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQGPnH8iejC-yw/feedshare-shrink_800/0/1719321265702?e=1722470400&v=beta&t=ZXEUBCSWIbLFaEMCSKCF_Hw3GZxaagVeip_eW-QjMHk",
        "likes": "32\nAizaz Ahmad and 31 others",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-06-21 15:11:43",
        "content": "I took this as a weekend challenge, explored Hugging Face, and built some Colab Notebooks and Streamlit apps to analyze the performance of LLMs like Llama3 & Jais. And everything worked great.\n\nIn the first year of, I was very much hands-on with engineering. But with the team expanding and new business challenges coming up every other day, it became too hard for me to code myself.\n\nEven though I love it. I love to code, build things, and architect the solutions as a piece of engineering art. But I can't focus too much on it. I can give my input on different projects, help out with some technical decisions, but I can't be very much hands on. If I do, the business might struggle.\n\nSo a couple of weeks ago, a client reached out. They needed help with something that I had never worked on myself. Though our team had worked on such things a lot, so I knew if I failed, our \"rockstar engineers\" would jump in to help this \"rusty engineer\" out.\n\nSpent some days on it, spent the weekend, and.... you can see what the client says in the picture below👇🏻\n\nSo maybe..... I am not that rusty..... yet!\n\nMission ✅",
        "date": "4d • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQGPRsXviIorAg/feedshare-shrink_800/0/1718982701748?e=1722470400&v=beta&t=5tcaCtqdh0yeYfkZdoTU6dEKfoqNa92edYlq_KA3QeY",
        "likes": "75\nYou and 74 others",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-06-14 13:24:31",
        "content": "People are loving Track your Subs 🎉\n\nWe launched Track your Subs almost 1 month ago and seems like we really solved an actual pain point of some people.\n\nWithin just one month, we have released some major updates to the app like:\n\n💹 Improved stats\n🌎 Multi-currency support\n🏷️ Labeling and categorization (should be live within next few hours 👀)\n✨ Bunch of UI improvements and enhancements\n\nWe are serving 140+ registered users and 700+ users in total, most of them from the US. We heard the feedback of users and implemented most of the features that people requested.\n\nIf you still haven't given it a try, go check us out (and leave us a review 👀) and let us know if you have any feedback.\n\nDownload Now ->",
        "date": "1w • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQGjpSpAUBbm1Q/feedshare-shrink_800/0/1718371469804?e=1722470400&v=beta&t=Gp2ZTO7cVyQx2_Lysq382NW3jWZWjxfsn7EzJUTJAIs",
        "likes": "61\nOsama Riaz and 60 others",
        "commentsCount": "5 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-06-11 15:17:28",
        "content": "These past one and a half years have been crazy for tech 👇🏻\n\n- OpenAI, a company no one had heard of, became the most popular tech company in the world\n- Every other company tried to follow suit and launch their own AI\n-crossed $3 trillion market cap because of this AI mania\n- Some of the biggest names in tech fell behind in the AI race\n\n&\n\nfinally, yesterday,announced Apple Intelligence (AI). Making AI even more mainstream by integrating AI features in all of their product line up.\n\nIf you think AI was overhyped, get ready to be bombarded by even more AI startups, and AI products coming up after this announcement.",
        "date": "2w • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQG3xZXDm14LAw/feedshare-shrink_800/0/1719125816844?e=1722470400&v=beta&t=lQcJz18nT2Y6TYt4sYiBeHhGWF8XXMcbOL7fUcpr5iY",
        "likes": "39",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-06-10 14:38:44",
        "content": "Some bold and unconventional bets I took while building RipeSeed 👇🏻\n\n1 - Adding our engineers directly to our Upwork agency, with their own personal profiles (not company-owned). They are free to take their profiles with them if they choose to leave.\n\n2 - Not calling ourselves a \"US-based\" company. Neither on our Upwork, our website, or our social profiles. We proudly own and operate as a Pakistan-based 🇵🇰 software company.\n\n3 - Hiring our engineers on contracts with their own profiles, not just with my profile, hence resulting in many Top Rated Plus Profiles on our Upwork agency account.\n\n4 - Not faking our team's capabilities. Not shadowing junior engineers with the names of senior engineers. Even if that means losing a potential customer. If we can't do something, we communicate that clearly.\n\n5 - Not hiring interns (SEs) to cut costs. Instead, we always hired engineers who had prior experience in full-stack development. As an early-stage company, we can't afford to invest our time in training engineering interns.\n\nAll these steps are very unconventional and considered risky in the agency business. And I'd be lying if I said I wasn't afraid of them. But I was willing to either not grow at all, or grow on the right terms. And I think it worked out decently well for us.",
        "date": "2w • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQGa5bcFBw_1mA/feedshare-shrink_800/0/1719193865557?e=1722470400&v=beta&t=GpJT-3jOkjtshK00Pz6jwY_hi7FPmTdXThVRxF2jZJ4",
        "likes": "331\nRizwan Amjad and 330 others",
        "commentsCount": "50 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-06-07 11:35:05",
        "content": "I just COULD NOT live an “automatic” life...\n\nBack in my college days, when people were just focused on passing their exam to get into a good university, I could have gone with the flow and just focused on my curriculum. But I ended up watching the whole playlist ofbyand learnt C++. My first step into programming.\n\nAnd then finally after getting into,, the university I wanted to get in, I could have just gone with the flow, followed the defined path and enjoyed the university life. But I ended up doing freelancing, working on more real world projects before graduation than most people do in their first four years of career.\n\nAnd then after graduating, I could have just lived and enjoyed my life on the nice paychecks I was getting from my jobs. But I continued doing freelancing alongwith all my jobs, making my nights harder and sleepless, while still working honestly and fulltime in my day job.\n\nAnd then I could have just continued doing jobs, switching from one company to the other. But I ended up starting, building a team, with no business experience, no funding or bootstrap money. Taking the constant headache, stress and worry of what the next day is going to be.\n\nAnd then finally.... I mean finally... I could have just taken the easy way out to build the business, shadowing people by faking their experience/names/profiles, but I opted to stay honest to our customers. Showing our capabilities for who we actually are and what we can actually do. The path usually not taken by initial stage companies (or even some mature ones as well)\n\nAnd I am so thankful for all of it. I don't think all of it can be categorized as hardwork. Alot of it is luck and prayers. Many things have to go right for all of it to result in a positive outcome. But I am so glad I could not live the life on auto-mode. And I hope it stay that way.",
        "date": "2w • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQH09liJBCtOEw/feedshare-shrink_800/0/1719170214109?e=1722470400&v=beta&t=q4-tmR0YSMSRnmAgesU4Yzv5q5w082WeZINtmLHs9Vg",
        "likes": "139\nYou and 138 others",
        "commentsCount": "5 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-06-06 12:07:35",
        "content": "Track your Subs users just received this notification 🔔 \n\nIt's a public apology, because we know hundreds of our users are now relying on us to keep track of their expenses. We know we messed up and we know we need to announce this so people can update their apps and keep enjoying the seemless experience.\n\nWe would've never caught this bug if we weren't using the app ourselves. Track your Subs solves an actual pain point of the people who are subscribed to a bit too many subscription service, for better or for worse.\n\nWe have received an amazing response from people, a lot of downloads and people actively using the app to keep track of their expenses. Looking forward to serving more users and super excited for the next set of features we are working on based on the feedback we have received.",
        "date": "2w • \n ",
        "image": "https://media.licdn.com/dms/image/D4D0BAQHqCkXj3H3aRA/company-logo_100_100/0/1694153319080/ripeseed_logo?e=1727308800&v=beta&t=57r4mWIxhJW23i36Fl9OmzbkraNwuWhmDxspbMfoxYY",
        "likes": "16",
        "commentsCount": "3 comments",
        "sharedBy": "RipeSeed",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:7204447873818595328/"
    },
    {
        "postTime": "2024-05-31 12:43:24",
        "content": "The tiredness, the pain, the tough times, and the sleepless nights will go away. And when it’s gone, all that’s left will be the reward you gained from those efforts.\n\nI unlocked this life hack a few years ago. It’s more of a realization than a life hack.\n\nThe hardship is temporary. The reward is long-lasting.\n\nFeeling really tired because of a project or a client?\n↳ Just get it done and get it over with. When it's done, you'll be able to rest, the customer will be happy, and you'll be left with a good testimonial and a happy customer\n\n\"It's weekend and I still have to work. What about work-life balance? What about personal time? Why did I commit to something like this?\"\n↳ Just do it and deliver what you promised. You know you took this challenge to upskill yourself. Why back off now? When it's done, you'll have learned something you always wanted to learn and there will be plenty of weekends to enjoy.\n\nI have had situations like these where I thought I should just get out of the tough situation by taking an easy way out. By giving up the challenge. By refunding the client. By giving up the project. But this thought, that when all of this ends, I'll be left with a reward that'll stay longer, unlike the tiredness and burnout that can be cured with a good night's sleep.\n\nSo .... keep going.",
        "date": "3w • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQGo1Q00vZHrpQ/feedshare-shrink_800/0/1717159403151?e=1722470400&v=beta&t=dsPti3d3dRka9cFHRwfbehe3il1PJaL0Lw5Wi9WS73Q",
        "likes": "86\nOsama Riaz and 85 others",
        "commentsCount": "5 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-05-24 14:11:01",
        "content": "Hard to swallow pill: Things really work out, if you are willing to put in the work.\n\nThere's no way around it. You cannot outsource it. You cannot delegate it.\n\nYou can procrastinate if you want to, and you'll have to pay the price for it, but things will never figure themselves out.\n\nAnd I have seen this happen a lot in the past few months.\n\n1. I was worried about losing some recently closed clients. \"What are we doing wrong?\" And it happened a few times before but I never thought much about it. I was confident we'd close more. But I am glad that pride was shattered and I got to look deeper into the problem. And just because I spent time looking into the problem, I figured it was about relationship management and better customer experience. We worked towards perfecting these two things and we improved a lot.\n\n2. Sales were really slowing down, number of leads generated and closed was going down as well, and I decided to just spend 2-4 hours every week with the sales team to look into the issues. Turned out that our outreach had a lot of room for improvement. I did my best to guide our sales team and our numbers finally increased.\n\n3. Everyone wants to build a good public image of their brand. But only very few people are willing to put in the work. I spent a lot of time rethinking our social media strategy, thinking about what we could do to stand out. Now, all the carefully crafted content you see on's profile and website is a result of that thought process and spending many hours per week, thinking about what more we can do.\n\n4. My team has delivered some amazingly complex projects with AI & machine learning. But I was always reluctant to get into it myself. I was a hardcore developer. And somehow, AI became a black box for me. I never spent much time looking into it, assuming that it's beyond me. Until last week. A client reached out with a project where they needed help with some Arabic LLMs. I don't know what got into me, but I decided to take on the challenge myself, spent the weekend cursing myself why I took on the challenge (we all do, right? right?), and finally delivered what the client needed. And now, it's not a black box anymore.\n\nAmazing isn't it? Who could've thought that just putting in the work ..... actually works out!",
        "date": "1mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4E22AQGqrfnFMKtOsQ/feedshare-shrink_800/0/1716556241764?e=1722470400&v=beta&t=m8C2wICIT5qnKx0TlzqTDHDNQnipPl1IyzJOWzoz2NY",
        "likes": "101\nSidra Komal and 100 others",
        "commentsCount": "5 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-05-23 15:14:35",
        "content": "After a successful launch and amazing feedback from people, we released a huge update for Track your Subs 💵 yesterday. Here's the thought process that went behind that release:\n\n💰 People don't always have their subscriptions in the same currency. Their local apps & mobile data charges are usually in their local currency. So having support for multiple currencies is a must. I brainstormed withand we came up with an approach. So we added support for 100+ currencies in this release\n\n☁️ We got hundreds of downloads 🤯 but people weren't signing up 🤕 I asked myself, why? We clearly have a \"Login\" button on top of the app. Turns out, users didn't know why they should sign up. What do they get out of it? What features are enabled by signing up? So we added a nice popup showing the user that they will be getting cloud syncing support and will be able to view/manage their portfolio across multiple devices\n\n💹 One of the key reasons people will use Track your Subs, is that they wanna know at a glance what they are paying on a monthly basis. Our overview card was nice and simple but something seemed missing. So we revamped the whole card and nicely added the cumulative sums for both current and next month, so users know what to expect next month.\n\n🧹 And of course, we needed to clean up some bugs and issues that the users reported and made the UI a bit more nicer and cleaner.\n\nIt's been so exciting working on TYS, listening to user's feedback, and implementing them accordingly. I'll try to keep posting about how it goes from an engineering + marketing standpoint as well.\n\nSo... if you still haven't.... then go Track your Subs 💵\n\nAndroid:\niOS:",
        "date": "1mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQHrrboNYkQZYg/feedshare-shrink_800/0/1716477274051?e=1722470400&v=beta&t=w7_MyG7SVshMjP7s0grW6g5GUIwqFhCRfRLJ_ENrUeY",
        "likes": "56\nOsama Riaz and 55 others",
        "commentsCount": "8 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-05-22 11:40:48",
        "content": "We have just released a huge update to Track your Subs 💵\n\n✅ Support for 100+ currencies\n📊 Improved expense overview\n✨ Cleaned up the UI a bit more\n🐞 Fixed bugs in the cumulative sum algorithm\n\nWe have seen great adoption after our initial release and the interest of general public clearly shows that people were waiting for something like this. We are releasing some very essential features with this update and we would love to hear your feedback.\n\nDownload now and go Track your Subs 💵\n\nAndroid:\niOS:\n\n\n\n---------------\n\nEdit 1: Seems like this update is crashing the app on some android devices. We are currently working on it and will be pushing a fix soon.\n\nEdit 2: The issue is fixed now 🎉",
        "date": "1mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4E03AQF5iOwHjAfBGg/profile-displayphoto-shrink_100_100/0/1678167415920?e=1724889600&v=beta&t=LapSxPdtX2ZAlf59-Avnshuo15pmML6kptdZglKTX8o",
        "likes": "23\nHashir Baig and 22 others",
        "commentsCount": "6 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-05-21 13:53:08",
        "content": "People are afraid of directly engaging their customers with their employees because they are afraid that either their customer will hire their employees directly or their employees will steal away their clients. \n\nNever happened with us. Never. Once.\n\nSince day one, we have engaged our team members directly with our customers.\n\nThe team gets to learn how to effectively communicate with a customer.\n\nThe customer feels like they are being given more transparency about what is being done and by whom.\n\nA win-win for everyone.\n\nSo does that mean that the fear is totally unreasonable? No, I don't think so. Things like these happen. Never happened with us, but they do happen in the world.\n\nAnd they happen because of the following reasons:\n\n- Your team doesn't like working with you or your company. They might fear you, but they don't like you. Which is why they won't care if any of their actions hurt you or your business.\n↳ Solution? Be likable. Work towards the interests of your team as well. Be approachable and make sure they feel comfortable enough to reach out to you whenever needed.\n\n- Clients don't get any value out of working with you. You are just a middleman and you have invested exactly zero number of hours in establishing a relationship.\n↳ Solution? Provide some value other than the manpower to your clients. Be the consultant who is working for them without charging anything extra. Provide your own consultancy as a complimentary service. They should work with your company because of you, not just because of the manpower you have.\n\nIn our lifetime (almost 3 years now), only two of our customers tried to directly hire our team members. And what then happened? In both cases, the team members reached out to us and told us that the customers were offering to hire them directly. And in both cases, the team members preferred staying with us.\n\nI'll just call ourselves lucky, but there might be a pattern to this luck as well.\n\nGo find your own pattern.",
        "date": "1mo • \n ",
        "image": "",
        "likes": "40",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-05-20 12:22:58",
        "content": "I genuinely feel like my team should grow. No strings attached. And every step we have ever taken, every policy we have ever made, has been around this one simple goal. \n\n1/ Even though we started with Upwork and our main client base has always been from Upwork, I never wanted to have the culture in my team where everyone is tracking their screens and logging each and every minute of their hands on the keyboard. We clearly communicate with our clients that if you really want to work with us, screen trackers are out of the question. And we have definitely lost a handful of opportunities because of that, but so what? We have a pool of good and decent clients who align with us on this mindset.\n\n2/ In the first few months, when my team members were undergraduates and in their last semester, I clearly asked them to go ahead and apply for other companies. There's a certain fun attached to it. I didn't want to steal this from them. I told them to apply anywhere they want, and whatever offer the industry will be giving at that time, we'll offer more. And we did. And all three of those team members are still with us today. (so proud of it, I know I keep mentioning this in every other post)\n\n3/ We had some really good team members leave us. My process is simple. I talk to them and see if the opportunity is better for them than working with us. And if it is, I encourage them to go ahead and explore the industry. Take on this new opportunity, grow themselves professionally and then come back to us as senior team members.\n\n4/ I have gone as far as advising an interviewee once to go ahead and accept another remote company's offer. Not because he wasn't good, he was one of the most exceptionally talented one I ever interviewed. But as per his goals, that other opportunity was just way too good.\n\n5/ I try to talk to every team member in 1-1 meetings. As a small company, this is our leverage. I get to personally connect to each and everyone, help them with their goals, and try to match our goals with theirs.\n\n6/ I love guiding my team in their own personal projects, products, or issues they are facing with their clients. I have nothing to lose. And it's fun. If they are here helping me figure things out in RipeSeed, I should be there to help them figure out theirs as well. Right?\n\nPeople keep asking me how we have been able to build such a great team, Alhamdulillah. And I think the answer lies somewhere over here. But I think if you genuinely work towards the success and goals of your team, your team will eventually work towards your success and will try and understand your pains as well.\n\nWorked out pretty well for us.",
        "date": "1mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQGQSwFlQ1c-XQ/feedshare-shrink_800/0/1716207776693?e=1722470400&v=beta&t=wh7JCHLfu74UeUGyCV0Pb1EPIQieg-7rOxXNCwHbCCg",
        "likes": "88\nSidra Komal and 87 others",
        "commentsCount": "9 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-05-13 13:29:30",
        "content": "Keeping your moral compass in check is critical in your personal and professional life. And we have rejected so many opportunities just because our moral compass didn't allow us to pursue them.\n\n\"𝐈'𝐥𝐥 𝐨𝐧𝐥𝐲 𝐰𝐨𝐫𝐤 𝐰𝐢𝐭𝐡 𝐲𝐨𝐮, 𝐧𝐨𝐭 𝐰𝐢𝐭𝐡 𝐲𝐨𝐮𝐫 𝐭𝐞𝐚𝐦\"\n\nIt's a phrase we have heard from the very early days and we still do. And that's fine. I respect that. Some people might not be willing to work with agencies and that's fine. All of the clients we have ever worked with knew who they were working with and we kept the team, the processes, and the faces always transparent.\n\nI worked with a client in the early days to help him fix an urgent issue. He was really impressed. He told me he has other projects in the pipeline that he'd like to hire me for. I told him that even though I am the only person in the team right now, I'll later hire more people, and if someone is suitable, he'll be working on the project. That was a deal breaker for him. I tried to convince him but he didn't agree and I had to let him go.\n\nNow I could use the excuse of being the only person in the team to hide the agency, but if I had crossed that line in the early days, that line would have vanished right then and there.\n\nNo one likes to lie. Even the people who do. But if you do it once, it becomes so much easier to do it the second time, and then the third, and by the fourth time, your moral compass is tuned to ignore it altogether.\n\n\"But... but... I am just starting out\"\nYou won't be able to fix your ways if you start the wrong way. Let it start slow. Face the difficulties. You won't know what to fix if you keep ignoring the problem.\n\n\"But it's hard these days\"\nThat's not an excuse to lie to your customers. If everyone starts lying, how do we know who to trust?\n\nGod knows we have said \"No\" to opportunities even in hard times and only God knows how (because I don't) we were always able to get out of the hard times.\n\nThe world becomes a much better place if all of us (or at least the majority) just keep our moral compass in check.",
        "date": "1mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4E22AQEbG10f6XyVUg/feedshare-shrink_800/0/1715606969062?e=1722470400&v=beta&t=ccexRrTaT81Wl2ebuk1AV7ETrcJmXmhRNme3yqAIkP4",
        "likes": "57\nHassaan Ahmed and 56 others",
        "commentsCount": "4 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-05-09 13:31:07",
        "content": "I was always reluctant to work on our products. I was afraid that like many other service-focused companies, we'd end up using these products as filler projects, and won't be able to launch them due to a lack of focus.\n\nOr worse, we'll focus too much on them and our focus will divert from the revenue-generating part of the business (working with clients) to the non-revenue-generating part of the business.\n\nBut then, near the end of 2024, I metand saw the amazing work he was doing, launching his own products and running a profitable business out of it. That served as the first seed of motivation in me to focus on building something of our own. I started following more people on Twitter and LinkedIn and discovered,,, Bhanu Teja (pbteja1998 @ X), and a few more bootstrapped SaaS founders. They were building and shipping like crazy and some of their products skyrocketed.\n\nSo earlier this year when I posted about our achievements in 2023 and our goals for 2024, I mentioned that we'll finally start working on our products.\n\nNow the problem was, what should we build? I was suddenly out of ideas and I could not think of anything meaningful. Wasted a month just writing and scrapping ideas on Notion.\n\nThen I thought to myself, \"Ok, I'll just develop the first thing that comes to my mind, just to get out of this mind-blocker\"\n\nThe criteria was simple:\n- Build something very simple\n- It doesn't have to be world-changing\n- Build something that can be released in 2 weeks\n\nSo the first idea was a recipe app. We built a simple recipe app and launched it, but we didn't announce its launch anywhere. Because the idea was a bit too basic. But that really served its purpose. It opened my mind to more ideas and the next one that came to my mind was:\n\nTrack your Subs 💵\n\nWe estimated 2 weeks for its development. But it was a bit more complex than we thought. Offline capability seemed crucial. We added a feature to track whether or not you have paid for it or not. But later we scraped that because we wanted to keep it really simple. Too many options make the apps harder to use. We added history, editing records and few more tiny features like these that make the overall experience really good and help keep track of your expenses. Our designers were also occupied with client projects, and those have the highest priority. All these factors contributed to the delay in release.\n\nWhat was originally planned to take only 2 weeks, ended up taking 2 months.\n\nThen finally yesterday, I publically announced the launch of Track your Subs. And we were overwhelmed by the response.\n\nWe got 30 signups, and of course, a feature crashed for some users. Spent a few hours last night releasing a hotfix with. We've got a lot of ideas and feature requests and we are now planning to release some exciting updates soon.\n\nSo... stay tuned!",
        "date": "1mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQHZ3dqhHJD8fw/feedshare-shrink_800/0/1715261466384?e=1722470400&v=beta&t=I4EZ3HHA2x5x5iBXKBxG2L6bklZ7eVqwLwvJZc1a-Vo",
        "likes": "91\nHassaan Ahmed and 90 others",
        "commentsCount": "14 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-05-08 12:03:38",
        "content": "We are (finally) launching our (kinda) first product 🎉\n\nTrack your Subs 💵\n\nAndroid:\niOS:\n\nProblem: With so many apps and services offering monthly subscriptions, a lot of us are surprised to see random messages like \"$$$ has been charged on your card\" and at that moment, it's already too late.\n\nSolution: Track all your subscriptions in one place, have a look at your overall upcoming monthly expense, and get notified a few days before you are going to be charged, so you can go and unsubscribe if you need to.\n\nThere is a long story behind how we came up with this idea, why we decided to build a product of our own, and how we launched. I'll be posting more about it very soon here, but for now, go check it out and give us your honest and brutal feedback.\n\nCredits:\n- The muscle\n- The artist\nMe - (Just) The brain\n\n------------------------\n\nUpdate 1 (May 8th 2024 - 7:30 PM GMT+5):\n\"Sign Up with Apple\" seems to crash the app. We are looking into it. Thanks for letting us know guys. For now you can use the app using \"Sign in with Google\"\n\nUpdate 2 (May 9th 2024 - 1:00 AM GMT+5):\n\"Sign Up with Apple\" is now fixed and renamed to \"Continue with Apple\". Thanks a lot for reporting the issueBhai 🙌",
        "date": "1mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQHlaCO5JlM91Q/feedshare-shrink_800/0/1715169816474?e=1722470400&v=beta&t=BJUXSzJOJQ8no0qt-DuHBvGdnyVaI83R7hNT0zm9rw0",
        "likes": "175\nYou and 174 others",
        "commentsCount": "44 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-05-02 11:20:49",
        "content": "Stress is good for business—or at least, it proved good for me and RipeSeed.\n\nNovember 2023 to January 2024 was the most stressful time for me, running RipeSeed. We were struggling to close new clients, some of the existing ones ramped down, and as the team size increased, for the first time ever, I started seeing that we might go negative (in revenue) if somehow we didn’t close new clients.\n\nThat stress made me do things that I had never done before.\n\n1. I have always been pushing my team to explore more ways to generate leads, but if you are not good at something yourself (especially in the initial days), it’s really hard to make your team believe that it can work. So in these desperate times, I started engaging more and more on various social platforms, and luckily, to my surprise, I was able to schedule multiple calls and was able to build some good relations.\n\n2. Unlike my usual self, I reached out to Sir, CEO of, a very well-reputed firm, one I am a fan of and I had the chance to work in, asking for mentorship and guidance. To my surprise, he agreed. I met him and discussed all the issues I was facing and the amount of value I got from him was immense. It really opened some doors in my mind.\n\n3. After my meeting with him, I started reflecting on the topics we discussed, and I figured something out. I figured that I was worrying too much about increasing the outreach. Instead, I should have been more focused on the quality of outreach. And this revelation was the best thing I did for our sales early this year. I started conducting 1 hour+ sessions every week with the sales team to review the quality of outreach we were doing, and started giving them my feedback on their approach on a weekly basis. And we saw some amazing results because of this.\n\n4. I reached out to some existing clients of ours and discussed the possibility of longer-term contracts, instead of one-off or ad-hoc engagements. And multiple clients of ours agreed to longer-term engagements.\n\nIf it wasn’t for this time of panic or stress, I might have never stepped out of my comfort zone and taken these steps to fix these issues.",
        "date": "1mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQEK_9go3r7Khg/feedshare-shrink_800/0/1714648847174?e=1722470400&v=beta&t=AvnueR5xE4tn7cVh1Ps-foLSJeccQwpagdB8XySRp7Y",
        "likes": "110\nSyed Hassan Mustafa and 109 others",
        "commentsCount": "6 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-04-27 10:50:38",
        "content": "*companies spending millions $$$ in marketing their half-baked, barely working AI products*\n\nZuck 👇🏻",
        "date": "1mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQEUlDhcHD3mbQ/feedshare-shrink_800/0/1714215036266?e=1722470400&v=beta&t=nbk1qz-4kCNsvyKAMa09tLdr3JlqlHEs7fN1ZyiP7kU",
        "likes": "18",
        "commentsCount": "3 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-04-21 08:57:55",
        "content": "I tested Mathematical capabilities of Meta AI. It failed initially but then performed remarkably well 💯\n\nChatGPT and other Gen AI models don't work great with Mathematical calculations. (I actually haven't tested ChatGPT with this in a while so can't say for sure what the current state is)\n\nThe problem:\n\n\"Calculating bill for engineering resources, based on the number of hours worked\"\n\n1/ Initially I only told Meta AI that we work 40 hours/week\n2/ It calculated correctly for January, but for February, somehow it calculated a higher amount, even though it recognized that February could be 28 days\n3/ I corrected it's mistake and it calculated a correct amount for next month\n\nThen I provided more clarification:\n\n\"We actually work 8 hrs/day, from Monday to Friday only, recalculate the bill for each month according to work days\"\n\nAnd here it worked surprisingly well. It correctly calculated the cost for both months. But couldn't infer that this year is Leap. So I prompted accordingly and it readjusted the calculations.\n\nReally surprised that it was able to do these calculations accurately. Will have to test a bit more to see how reliable Meta AI is for analytical queries, but this little experiment was 👌🏻",
        "date": "2mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFH4-XV3uxh8A/feedshare-shrink_800/0/1713689874110?e=1722470400&v=beta&t=V3kXvlm4KYpUFTaGvDB0kV8Ba3YahEfs88bZStmDFpQ",
        "likes": "35",
        "commentsCount": "5 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-04-20 19:49:05",
        "content": "Ok so I played around with Meta AI on WhatsApp And.... it's pretty handy. \n\n✅ Asked to create images of people celebrating birthday (inspired by that Sora video) and it did decently well. Number of fingers seemed accurate. Asked to make changes in the images and result was still decent\n\n🚫 Failed to generate images based on real people. Tried for Benedict Cumberbatch and Elon Musk\n\n⏳Asked to generate images of kids playing in ground, result was good but facial features were pretty bad\n\n🤷🏻‍♂️ Asked about value of BTC and whether or not halving has happened (it happened yesterday) and it didn't know about it. Admitted that it doesn't have real time knowledge of the internet.\n\n✌🏻 Asked to generate a summary of Rich Dad Poor Dad and generate images of Rich and Poor dad as per the book. And even though I don't totally agree with the representation, it's not totally disappointing as well\n\nand then finally....\n\n🤞 Asked about myself just by my name \"Tell me about Hashir Baig from Pakistan and everything he's doing\" and it said it doesn't know any notable figure by that name.\n\n👏🏼 Asked about, to which it gave a detailed description of everything we do. Then I asked about who's the founder and it gave me a generous intro about myself (now I can sleep peacefully)\n\nSuper fun so far. Let's see where it goes!",
        "date": "2mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQHt6oiPdIFSGg/feedshare-shrink_800/0/1713642542900?e=1722470400&v=beta&t=KvY72d6c2p5RD0PLdu_1ru78rEEVauYdV7AljD3FJPI",
        "likes": "70\nSidra Komal and 69 others",
        "commentsCount": "9 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-04-19 14:17:53",
        "content": "It was mid-Feb and an old client of ours reached out. They needed to build an MVP for a Health-tech app with a dedicated interface for Patients, Healthcare providers, and key stakeholders. It was the kind of project that every engineer wants to get their hands on and we got super excited to work on it.\n\nI called(the Engineering Lead @ RipeSeed) to start the planning phase of the project and see how we can allocate resources to get this project delivered successfully and \"on time\". Time was the key here. We wanted to make sure that we were not overwhelmed by the huge scope.\n\nSo we started breaking down the features and defined smaller & achievable goals. The first goal was for 2 weeks, where we planned to deliver the patient app, that could allow the patients to input how they feel and point out where they feel the pain in their body in an interactive UI.&started working withto deliver this first phase. Near the end of 2nd week, we felt we might be exceeding the deadline a bit.\n\nAs much as I hate to have my team work overtime and on the weekends, we had a discussion with the team and they understood the nature of the project and deliverables and agreed to go the extra mile. We communicated with the client as well, that we might be a couple of days overdue on the deadline, they agreed and we finally delivered a functional Patient app to the client. This helped boost the morale of the team and we were on our way to the next phases of the app.\n\nThe team was keen on delivering a piece of art with this project, so we took more time than we originally estimated, just because we wanted to do things the right way, even if that meant we'd be off by a couple of days in the delivery. Of course, we kept the communication channel open with the customers and they appreciated that we were prioritizing good engineering over everything.\n\nAnd then finally this month, we delivered the last phase of the project and handed off everything to the client side. The end product was done so well that every stakeholder on the client side appreciated the team's effort and was super happy. And below you can see how the whole team felt after the successful delivery of this project.\n\n~",
        "date": "2mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4E03AQF5iOwHjAfBGg/profile-displayphoto-shrink_100_100/0/1678167415920?e=1724889600&v=beta&t=LapSxPdtX2ZAlf59-Avnshuo15pmML6kptdZglKTX8o",
        "likes": "69\nRizwan Amjad and 68 others",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-04-18 11:06:34",
        "content": "An 'opinion' should be unbiased. \n\nAn 'opinion' should not be used as a tool to 'sell'. \n\nThe sole purpose of an opinion should be to help the other side. Without having your own personal benefit. Or even if you do have your own benefit, make sure it's stated absolutely clearly.\n\nWhenever someone asks you for an opinion or advice, they are asking for help on a matter they feel they don't have expertise in. If later they find out that your suggestions were biased, and you had your own hidden benefit in them, you'll lose your credibility for a lifetime.\n\nAnd this happens a lot in consulting businesses. Customers are usually not aware of how to achieve their desired results. How to build something in a cost-effective manner, whether or not something should be pursued, given the time and budget constraints.\n\nA consultant should always try to give unbiased opinions, even if that means losing or cutting down on the scope of work.\n\nWe don't hesitate to say:\n\n\"We might not be a right fit for such a project\"\n\"This feature might seem simple from your perspective but it'll require significant amount of work. Are you sure we should do it?\"\n\nAnd clients always appreciate this input. As a consultant, your job is to work for the client's success. Not solely for your personal benefit. If all your opinions and all your advice boil down to increasing your own revenue numbers and achieving your own goals, you are playing a losing game.",
        "date": "2mo • \n ",
        "image": "",
        "likes": "6",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-04-17 12:22:03",
        "content": "It's not fun arguing with a customer. It's difficult to say \"No we can't tolerate this\". You risk losing them. But sometimes if you don't take a stand at the right time, you develop a toxic relationship with a client, which is very bad in the long run.\n\nWe were working with a customer over a year ago and I started noticing a change of tone in their messages. Their messages were aggressive and their behaviour with our engineers started feeling off. We were working with them for a few months already, so I knew there was longer-term potential, but if I didn't intervene then, the relationship was on its way to go downhill.\n\nI messaged them privately and told them they can't talk like this with any of our team members. It's not something we do in our company and it kills the motivation of the engineers who are working hard on delivering a fine product. To my surprise, the customer responded saying they didn't mean to hurt anyone and they might have been harsh with their words, for which they do apologize. In a few minutes, they dropped a message in the group chat apologizing for a harsh tone.\n\nAfter that day, they never turned aggressive and always gave their feedback in a respectful manner. We kept working for them for a few more months and the relationship was better than ever.\n\nWe faced a few more cases like these where I had to jump in and tell the customer that their behavior was not suitable, and luckily for us, in all scenarios, the engagement continued and we didn't lose the customer.\n\nTimes like these test you for who you really are. If you are going to have your team's back, or if you are going to do everything and anything to please the customers. And it's nearly impossible to build a strong culture, a trustworthy team, and a stable business if you don't stand up for yourself or your team.",
        "date": "2mo • \n ",
        "image": "",
        "likes": "67\nRizwan Amjad and 66 others",
        "commentsCount": "8 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-04-16 11:30:13",
        "content": "The hardest part of building a \"good\" tech company, is building a good engineering team. And you cannot build a good engineering team if you don't love the engineering yourself. \n\nThat is why unlike every other business, most of the successful tech companies are founded by engineers instead of businessmen. Ultimately those engineering-founders turn into businessmen, but the core of the business surrounds heavily around engineers. They are the raw product of a good tech company.\n\nThe company can have a vision, a plan, and goal to aim for, but if the raw material is not good, the end product is never going to be decent enough.",
        "date": "2mo • \n ",
        "image": "",
        "likes": "76\nRizwan Amjad and 75 others",
        "commentsCount": "8 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-04-04 10:47:02",
        "content": "The Rise of LayoutLMs and using Document Understanding Models Instead of Conventional OCR Techniques.\n\nCompanies are sitting on a ton of data, shared across the organization in the form of documents. That can be contracts, invoices, bank statements, or identity documents. The conventional OCR techniques are not very useful for structured documents, as the structure itself conveys a lot of context, and conventional OCR is only able to extract text from the document.\n\nTo solve that problem, we now have models like DONUT and some cloud services like's Document AI and's Document Intelligence that can help us extract meaningful data from structured documents. These models extract the context of the data along with the content, which means parsing invoices or bank statements can result in structured responses having information about pricing, transactions, debitors, and creditors without us having to infer the meaning of the data on our own, like we used to with conventional OCR techniques.",
        "date": "2mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4E03AQF5iOwHjAfBGg/profile-displayphoto-shrink_100_100/0/1678167415920?e=1724889600&v=beta&t=LapSxPdtX2ZAlf59-Avnshuo15pmML6kptdZglKTX8o",
        "likes": "12",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-04-03 16:45:22",
        "content": "Being honest in the business is not always going to be rewarding. And times like these test you for who you really are.\n\nAnd I have faced my fair share of challenges with my strict “honesty policy”\n\n- When we tell our clients that we are a small team that started just about three years ago, they don't always feel comfortable working with us. They might be looking for a bigger and mature company with many years of experience. And we have to let them go.\n\n- When we tell the clients that we are a team based entirely in Pakistan, and they don't always get ready to work with us right away. Yeah we can get ourselves registered in US for a couple hundred dollars, but even then I'll stick to what we actually are. If we have to face some stereotypes, so be it.\n\n- Clients don't always like working with agencies. Now we could tell them they can hire someone directly from us and hide a team of engineers behind the scenes, but that's strictly, morally and ethically wrong in my rule book and I've declined so many clients just because of that.\n\n- Clients don't always appreciate that we are a young team of super passionate engineers. Sometimes they are looking for 6-10 Years of experience and we have to respectfully let them go. Lying to them about something we don't have, is a no-go in my rule book\n\n- Sometimes clients are looking for some prior experience, and if we don't have that, we have a strict policy to communicate about what we know and what we don't. “We feel like we can definitely help you out with it, but if you are looking for experience, we might not be the right choice”\n\n\nPeople don't believe this when I tell them that's how we operate. But go ask anyone at, go ask any of our clients and you'll know the truth.\n\nAnd ever after saying “no” to so many clients, to so many opportunities, we were about to grow to a team of 28 people in the short span of almost 3 years. And I am happy with the progress.",
        "date": "2mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFY06YSrTgyBw/feedshare-shrink_800/0/1712162720553?e=1722470400&v=beta&t=CnQIfIjm34NC8SjNQ_HLAOHNFSKH9-ryEo45eME_A6I",
        "likes": "136\nYou and 135 others",
        "commentsCount": "11 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-04-01 11:05:40",
        "content": "You don't need to train custom machine learning models or learn any complex algorithms to get started with AI in 2024:\n\n1. Need to implement Facial Recognition in your product?\n\nUse AWS Rekognition by. I used this in 2019 to build a facial recognition based mobile app, which is working absolutely fine to this date.\n\n\n\n2. Have to add text based summarization, auto response or chatbot features in your app?\n\nUse's own GPT apis and use the industry leading AI capabilities in your apps. We have been building amazing products for the past 15 months, entirely on top of OpenAI's APIs and they have seen great success. And you don't need to have any knowledge of training the models from ground up.\n\n\n\n3. Need to implement speech-to-text capabilities in your app?\n\nWe have used both Amazon Transcribe () and OpenAI's Whisper () and the results are amazing.\n\n4. Need to generate images using AI in your apps?\n\nUse the APIs from DALL-E () and Stable Diffusion by(), the industry leading models, and easily add those remarkable image generation features in your apps.\n\n5. Want to link your own database or knowledge-base to GPTs and answer user queries based on that?\n\nUse() and easily extend the capabilities and knowledge of these already existing models.\n\n6. Need to scan your structured documents, like invoices and contracts, extract information from them and add to your ERP or CRM?\n\nYou don't need to build your own OCR or Document understanding models.has this amazing service called Document AI () andhas AI Document Intelligence (). They can read and understand structured documents, and allow you to fine tune their models, via a very user-friendly interface, so you can upload your own documents and improve the accuracy.\n\nGetting started with AI is extremely easy in 2024. The only barrier to entry is your own imagination of what you can do with it.",
        "date": "2mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQGnN783RbQLaA/feedshare-shrink_800/0/1711969538368?e=1722470400&v=beta&t=7mJFOOZFgGoBtFWuGa2jXjQtn5mGVSgWqXZDJ-JyKK4",
        "likes": "31\nRizwan Amjad and 30 others",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-03-29 10:06:08",
        "content": "AI didn't take our job. It actually helped us keep our job and create more in 2023, and it's doing the same in 2024. \n\nChatGPT launched near the very end of 2022, and till then, our skillset, as a company, was mostly in Full Stack Web and Mobile apps development, our team was mostly working on existing products of our clients, acting as an extended team to help them ship faster, or sometimes we were building new products for our clients, to help them validate their ideas.\n\nThen ChatGPT launched and we saw a flood of demand in AI products. Everyone needed to have their own version of ChatGPT or build something on top of it. A client reached out with a very unique idea. It was aimed to improve productivity in professional communications. I had a discussion with my team and looked into the current available APIs from. We told the client that it's NOT under our area of expertise, but we are confident that we can deliver it. The client agreed. 🤝\n\nA few weeks later, the initial implementation was done and the client launched the product in a few more weeks.\n\nThat blew up 🔥 For the client, and down the road, for us as well.\n\nThe product started doing really well, since we were very early in the market and solving a real problem. We started showcasing that product as a portfolio to more clients and we started closing more and more projects.\n\nIn 2023 alone, we worked on and shipped 14+ AI based products. This has now become a snowball effect. We have worked on so many basic to advance level projects, solved so many problems, that we are now able to consult the best possible solutions to anyone who's coming up with an AI product idea.\n\nDespite all that fear of recession, we were able to stay in business, grow our team, and up skill ourselves, just because of AI.\n\nAnd the situation is same in 2024. Most of the work we are doing is still on AI.\n\nSo AI never took our job. It actually helped us create more jobs and retain ours.",
        "date": "2mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFY284s3vZTXw/feedshare-shrink_800/0/1711706767102?e=1722470400&v=beta&t=mz6IqSYXs40Cjyzzz0vAy1CsHGU-SA_86jUhcsT1wYo",
        "likes": "56\nOsama Riaz and 55 others",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-03-23 22:36:11",
        "content": "\"We do this not because it is easy. But because we thought it would be easy\"\n\nIgnorance is a bliss for founders. If the founders knew how hard and painful it's going to be. They wouldn't start. If they could somehow foresee all the pain, suffering, embarrassment, risks, fear, they wouldn't start.",
        "date": "3mo • \n ",
        "image": "https://media.licdn.com/dms/image/C560BAQGIBh6yp6_q3Q/company-logo_100_100/0/1672882518452/acquiredotcom_logo?e=1727308800&v=beta&t=i5wCtLqPqa_7gOZ7Me9GwKffZYke2ZXaLRN5HsKwLcE",
        "likes": "17",
        "commentsCount": "",
        "sharedBy": "acquire.com",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:7177296950952677376/"
    },
    {
        "postTime": "2024-03-21 10:58:48",
        "content": "\"Oh I just need a basic web/mobile app. Don't worry much about best practices or a good UI. It's just an MVP\"\n\nThis kind of statement is an ideal example of:\n\n\"They don't even know what they don't even know\"\n\nI mean, clients really don't know how \"bad\" a UI can be designed. Without the help of our amazing UI/UX wizards, we, developers, can mess up the designs pretty bad on our own.\n\nAnd it has happened to us a couple of times. A client once asked us to build a simple one-pager web app, display some simple data on it, just a small simple job, that could lead to some bigger engagements. And he said \"Don't worry about the UI. You can make something bare bone on your own\"\n\nOur developers completed the whole thing, but the UI was just terrible. But they didn't think much of it, since client never asked for it, and they delivered the end product to the client. And the client just got mad. I jumped in, assured them that we'll get the UI improved and delivered a better version in a day, but they kind of lost faith (a bit too soon) and just wanted to end the engagement. We refunded the client and learned this lesson the hard way.\n\nNow we have a base rule.\n\nNo matter what the clients ask for, we have our own quality standards that we have to deliver no matter what. Even if they don't ask for a UI, our UX team will quickly mockup something reasonable enough. Even if they specifically ask not to worry about good practices, we'll follow our own good practices no matter what.\n\nBecause at the end of the day, we'll be known by the kind of work we'll deliver for our clients.\n\nInvesting on delivering quality products is the best marketing investment.",
        "date": "3mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4E22AQH9J6zHvbn2Hw/feedshare-shrink_800/0/1711018727131?e=1722470400&v=beta&t=NB7jAYZVrxBzDVLt98dBz1plZStdEvNjAemxBS3QWxc",
        "likes": "19",
        "commentsCount": "4 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-03-20 14:23:13",
        "content": "It's really hard to delegate something which you are not good at yourself.\n\nBe it engineering, sales, planning, marketing or hiring.\n\nIf you are not willing to be on the ground and solve each and every problem yourself, it's really hard, if not impossible, to maintain the quality.\n\nIt's not easy, but it's a harsh reality that everyone realizes sooner or later.",
        "date": "3mo • \n ",
        "image": "",
        "likes": "49",
        "commentsCount": "7 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-03-15 03:00:17",
        "content": "It doesn't make sense for AI to write code to build software/apps. Hear me out.\n\n\"Code\" or \"Programming Languages\" are an interface for humans to interact with computers. The very basic level is binary. Then Assembly came in as a layer of abstraction, then C and C++, and then all the other languages that build on top of them. All these languages just allow \"humans\" to instruct computers to perform some specific actions.\n\nDALL-E doesn't run a Photoshop instance to design the images. It just create a bunch of pixels purely based on the data it's trained on and it has learned. Sora doesn't fire up Adobe Premiere Pro or Adobe After effects to create videos. It just creates them frame by frame, pixel by pixel, out of nothing. That's how these Large Language Models work.\n\nNow coming back to programming, the Co-Pilot usecase makes a lot of sense, since it's helping people improve their code or review their code. But if we are talking about a complete application being developed by AI, it'll be more like how DALL-E and Sora works.\n\n- You input some prompt to build some features in a web app or mobile or desktop app\n- It just creates an executable binary or return a link for a deployed version for you to play around\n- Maybe it can show you a preview or \"Expo-like\" link where's it's not creating an entire build everytime, but a debug live preview link\n- If you need to make any changes, you can write follow up prompts and it'll just create a new build for you, like \"Hot Reload\" or \"Instant Run\"\n\nMakes sense, right? Think about it!\n\nSorry Devin, no offense!",
        "date": "3mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFrai3vSSje3A/feedshare-shrink_800/0/1710471616611?e=1722470400&v=beta&t=1WnDUmVs6FLW5xp_R89z6U9BP7_0sKrIKCFEHXf0Fpg",
        "likes": "77",
        "commentsCount": "20 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-03-14 09:26:44",
        "content": "I always used to say: \"Be a problem solver. The world has enough ReactJS developers\"\n\nBut I think now I need to add to it: \"... and Devin\"\n\nYesterday when I saw the demo of Devin, first thing that came to my mind was:\n\n\"Isn't it just like AutoGPT, but more user friendly?\"\n\nFor those who don't know, AutoGPT launched soon after OpenAI launched GPT-4 and it was basically just a GitHub repo. You set that up locally, add your GPT-4 api keys and run that on a terminal. You allow AutoGPT to perform actions on your behalf and write a prompt of the \"Goal\" you want to achieve. It searched on the internet, researched everything and performed the actions by prompting itself back and forth.\n\nThough the results were not always very reliable (as per my research back then) so it never caught much attention.\n\nYesterday Devin just made everyone, and by everyone I mean all the software engineers, panic. And you should really be panicing if you are not evolving with time. Not learning something new everyday or not keeping yourself up to date with the latest advances in technology. The primitive jobs like building a landing page or a stripe integration or creating a simple mobile app will be replaced soon enough, if they haven't already. Or even a bit more complex ones as well.\n\nBut what about that huge application that a company is already working on, with hundreds of code files, with a DB schema created by \"human software engineers\" (HSEs), with the naming conventions assigned by HSEs, with the architecture that involves integrations from 20 different third party services and involves deployment on a very custom cloud infrastructure. Is this all going be automated with Devin? I won't say it won't be, but the more complex the usecase and the problem, the harder it will be for AI agents to replace the human-element altogether.\n\nSo be a problem solver. If you have been surviving in the software industry with just surface level skills, it's about time you upgrade your skills and make AI the center of your skillset. So if someone who's not using AI can do something in 1 week, you should be doing that using AI, much faster and way better in a day or two (or less? Maybe)\n\nSo let's welcome Devin, whether you like him or not. He has already taken a seat just beside you in your office and he's so eager to compete.",
        "date": "3mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4E22AQFYm2T0m0Vzdw/feedshare-shrink_800/0/1710408403712?e=1722470400&v=beta&t=lT61nBM41gqU4TVzgPAX12nIdHqJYFbThhgOrUZyHvE",
        "likes": "80",
        "commentsCount": "4 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-03-13 11:59:24",
        "content": "\"....greatness is not intelligence, greatness comes from character and character is formed out of people who have suffered....\"",
        "date": "3mo • \n ",
        "image": "https://media.licdn.com/dms/image/C5603AQEu6HtzpUaTOg/profile-displayphoto-shrink_100_100/0/1517733668713?e=1724889600&v=beta&t=7wU6jZCHvtdw6FcY59xloil66ShTOpHgRNltlkuWrNo",
        "likes": "4",
        "commentsCount": "2 comments",
        "sharedBy": "Michael Jackson",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:7173612039980900352/"
    },
    {
        "postTime": "2024-03-11 12:46:05",
        "content": "I always position myself as the problem solver. Not as a development machine or a sales guy. \n\nIf a client expects us to just follow the instructions and deliver code, then we are not an ideal fit for them.\n\nAnd I've worked with both kind of clients. Those who really appreciate this, really thank us to help them find the most optimal solution for their needs and their budget. And those who just want us to work on their requirements without questioning anything.\n\nAnd without a doubt, our experience with the former ones have always been amazing.\n\nThere's been countless times where I suggested someone a better solution and told them that we might not be an ideal fit for them, but they can go to someone else or use some existing tool to get their job done. And it always caught them by surprise. They always say some variation of:\n\n\"Thanks a lot for your honest feedback. I'll be sure to get back to you when I have something you can help me with\"\n\nThe aim is not to just work with every client who responds to our outreach. The aim is to find the ones who fit ideally with our culture, who need what we have to offer, so we can use our engineering skills in the best possible manner.\n\nIs that going to narrow down the pool of prospects? Sure. Not everyone is in the market for good engineering practices and not everyone is our ideal prospect as well.\n\nWe have been doubling down on this approach in 2024 and it seems to be working out great for us and our clients.",
        "date": "3mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQEIf_JJhfJAAg/feedshare-shrink_800/0/1710161163886?e=1722470400&v=beta&t=Nl6yN0DpZ5ArNnHILomQClXnCAus6wk3xD_UwwpIuaI",
        "likes": "44",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-03-07 15:06:54",
        "content": "Networking is not a \"lead-generation\" activity. \nIt's a \"relationship-building\" process.\n\nAnd I was not expecting it to be this good.\n\nGot to know the amazing workand his team is doing at.\n\nMet withfromand had some interesting discussion.\n\nAnd I could just givethe award for the nicest person I've met. Awesome work they are doing there.\n\nIt was great meetingagain from. We met earlier at Gitex. These guys just raised $5m in funding. Kudos to them.\n\nHad a great discussion withfrom,&from Nasam.\n\nSuper tired after the 4 really hectic days, but super pumped up to see the potential in Saudi market and the exciting opportunities that lie ahead.",
        "date": "3mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFdvfsjlovKEA/feedshare-shrink_800/0/1709824011871?e=1722470400&v=beta&t=HOKeg8VSJFkQArvhSSu12wqLAFt_7zQnWOPK-pFRHR0",
        "likes": "87",
        "commentsCount": "4 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-03-06 11:14:12",
        "content": "You cannot un-see the massive opportunity that lies in Saudia, unless you have your eye closed.\n\nVision 2030 seems like an unrealistic goal to some, it seems a bit too over ambitious, but that's what the goals should be like.\n\nSaudia is aiming for the moon, and beyond, and have already landed in stars.\n\nAll the big-tech players are now operating from Saudia as well.\n\nSo many startups emerging and growing in months, not years.\n\nTruly enjoying the experience so far at2024. It's just massive!",
        "date": "3mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4E22AQFN0bz6K563Sw/feedshare-shrink_800/0/1709723358303?e=1722470400&v=beta&t=e6p1IPlG0mesl_tim8KO00nPGlljtmroe08IlKc9u0I",
        "likes": "148",
        "commentsCount": "7 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-03-01 10:29:48",
        "content": "Transparency is everything - All Hands 2024!\n\nWe conducted our All Hands this month. A much awaited one. \n\nIn the last couple of months, we made some critical policy changes and did some restructuring. The ones that were really hard to do, but had to be done.\n\nAfter all, if you are giving your 9 hours a day (or sometime more) to a company, you deserve to know how it's doing. Is there any growth potential? Why some changes were made? And why some of our amazing team members had to leave?\n\nBefore the All Hands, I circulated an anonymous form in our Slack channel for the questions the team wants to ask us, without having their identities revealed. I literally asked the team to be \"brutal\" with their questions.\n\nSo we started by following up on the promises and the goals we defined in our last all hands, clearly stating which ones we were able to successfully pull off this year, which ones ended up in the bucket of failed experiments, and which ones are still in progress.\n\nLike all initial stage companies (we are 2 years and 8 months old), we made some mistakes. And we acknowledged them. We discussed how we could have avoided them and how we plan to improve going forward.\n\nWe shared the numbers of how we are doing financially. Our revenue for this year was slightly more than last year, but since we scaled the team, our expense increased a lot more and we couldn't hit the revenue goals that we needed to hit to maintain a sustainable & competitive business model.\n\nIt also might have been the recession all around the world, but we can only look at the factors that we can control.\n\nSo we laid down a plan to tackle all of these problems. The plan that's not a product of my own mind, but something I came up with after having discussion with some mentors, reading some books, and trying to find answers online.\n\n- We need to be laser focus.\n- Scale up what's working. Close down what's not.\n- Start disqualifying clients and focus on longer term engagements only\n- Maintain and build better relationships\n\n& the most important of all.\n\nQuality engineering should be our highest priority. Nothing should come in the way of us building highest quality products for our clients\n\nI hope the next All Hands will have more team members, a bigger hall and all revenue goals smashed. InShaAllah.",
        "date": "3mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4E22AQEHzYMe3rRFLQ/feedshare-shrink_800/0/1709288984409?e=1722470400&v=beta&t=O1frS13j8-q-fTOUk9DUETZRV98H0Fz0MN8aY48p8_Q",
        "likes": "75",
        "commentsCount": "5 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-02-15 12:10:01",
        "content": "Everyone I meet says LEAP is huge, it's worth it. So I am going to give it a shot. I'll be in Riyadh from 2nd-9th March, and looking forward to meet new people, learn from their experiences and share whatever knowledge I have.\n\nDrop me a message if you are coming and I'd love to meet you there.",
        "date": "4mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4E22AQHlGd-Q0xfQ3w/feedshare-shrink_800/0/1707914207404?e=1722470400&v=beta&t=KgFRgViRP9RcH7v0dxT8wGlVx1glXiPyMu8-EWCGii8",
        "likes": "79",
        "commentsCount": "9 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-02-14 11:38:48",
        "content": "Mark Zuckerberg is running a Tech Giant like a startup, and it's a treat to watch.\n\nFrom being known as a weird, robotic figure casually sitting in his house, recording a comparison video of one of the most anticipated product (Vision Pro) by one of the most loved company on earth (Apple), with something he has been working on for a decade (Oculus / Quest), the transformation is just amazing.\n\nWith billions in the bank and a tech giant that he can exit from or delegate his role to the best minds in the world and live a peaceful life on some remote island, he instead chooses to be part of day to day, make some of the most bold and risky decisions (going into VR when no one was taking it seriously, renaming the company to Meta, to double down on VR, and then losing billions as result)\n\nIt's exciting and inspiring to see people in his position, presenting themselves to public in a casual, relatable manner. With the resources at his hand, he could run a huge marketing campaign comparing Vision Pro and Meta Quest, launch a video series, like Google did for comparison of iPhone and Pixel, but nope, he just decided to post a casual reel on instagram himself, comparing vision pro to quest, like an influencer.\n\nThis video is just one of the coolest things I have watched today.",
        "date": "4mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4E22AQFFbgIR-Lj44g/feedshare-shrink_800/0/1707910727068?e=1722470400&v=beta&t=RgLsEnss1Tl9EKC20ZOgFMDoNuvKnDaiRixyBxikLSY",
        "likes": "38",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-02-12 13:34:55",
        "content": "Are you \"hoping\" to get lucky or \"aiming\" to get lucky? \n\nIn mid-2021, I saw a client having some issue with his browser plugin. I saw the previous history of that client and he looked genuine. The work he needed seemed like a small quick fix. But I felt like there could be a potential.\n\nI reached out and offered to help right at that moment. These were my exact words:\n\n𝘐 𝘩𝘢𝘷𝘦 𝘸𝘰𝘳𝘬𝘦𝘥 𝘰𝘯 𝘌𝘹𝘱𝘰 𝘢𝘯𝘥 𝘈𝘞𝘚 𝘢 𝘭𝘰𝘵 𝘣𝘶𝘵 𝘵𝘩𝘦 𝘦𝘹𝘢𝘤𝘵 𝘱𝘳𝘰𝘣𝘭𝘦𝘮 𝘰𝘧 𝘺𝘰𝘶𝘳𝘴 𝘴𝘦𝘦𝘮𝘴 𝘱𝘳𝘦𝘵𝘵𝘺 𝘶𝘯𝘪𝘲𝘶𝘦 𝘵𝘰 𝘮𝘦. 𝘞𝘩𝘪𝘤𝘩 𝘪𝘴 𝘸𝘩𝘺, 𝘐 𝘢𝘮 𝘤𝘶𝘳𝘪𝘰𝘶𝘴 𝘵𝘰 𝘩𝘢𝘷𝘦 𝘢 𝘭𝘰𝘰𝘬 𝘢𝘵 𝘪𝘵 𝘸𝘪𝘵𝘩 𝘺𝘰𝘶. 𝘓𝘦𝘵'𝘴 𝘩𝘢𝘷𝘦 𝘢 𝘱𝘢𝘪𝘳 𝘱𝘳𝘰𝘨𝘳𝘢𝘮𝘮𝘪𝘯𝘨 𝘴𝘦𝘴𝘴𝘪𝘰𝘯, 𝘮𝘢𝘺𝘣𝘦 𝘢 𝘴𝘮𝘢𝘭𝘭 𝘰𝘯𝘦, 𝘸𝘪𝘵𝘩𝘰𝘶𝘵 𝘦𝘷𝘦𝘯 𝘴𝘵𝘢𝘳𝘵𝘪𝘯𝘨 𝘢 𝘤𝘰𝘯𝘵𝘳𝘢𝘤𝘵, 𝘢𝘯𝘥 𝘪𝘧 𝘐 𝘤𝘰𝘶𝘭𝘥 𝘩𝘦𝘭𝘱 𝘺𝘰𝘶 𝘸𝘪𝘵𝘩 𝘪𝘵, 𝘸𝘦 𝘤𝘢𝘯 𝘴𝘵𝘢𝘳𝘵 𝘵𝘩𝘦 𝘤𝘰𝘯𝘵𝘳𝘢𝘤𝘵 𝘢𝘯𝘥 𝘮𝘰𝘷𝘦 𝘧𝘰𝘳𝘸𝘢𝘳𝘥 𝘸𝘪𝘵𝘩 𝘪𝘵.\n\nThe client responded:\n\n𝘛𝘩𝘢𝘵 𝘸𝘰𝘶𝘭𝘥 𝘣𝘦 𝘨𝘳𝘦𝘢𝘵, 𝘮𝘪𝘯𝘥 𝘴𝘪𝘨𝘯𝘪𝘯𝘨 𝘢𝘯 𝘕𝘋𝘈?\n\nAnd that's how I started with them. But why am I posting about it? What's the big deal?\n\nAfter I signed the NDA, I got on call with him. I was able to help him resolve the issue in a couple hours and he asked if I am available for ongoing work on fulltime basis. I agreed.\n\nHe hired me fulltime.\n\nOne month later, he asked if I had another team member available, I had one, and he hired him as well.\n\nWe started delivering good work and about 2 or 3 months later, he asked for more developers, mainly in Angular. I reached out to some contractors and completed the interviews. Ultimately, we ended up onboarding about 5 developers to that client, at it's peak.\n\nAnd all of this happened in first 6 months of the company.\n\nWas that beginner's luck? Yeah I think so.\n\nBut I was really planning to get lucky. I wasn't just sitting idle, waiting for some opportunity to land in my lap. I was looking for prospects, trying to see potential, and applying everywhere I could. I was just increasing my \"probability\" of getting lucky.\n\nI was just reaching out to so many prospects, that I just happen to win by probability. And I apply this rule to this day as well. Do so many random things, so many times, that you ultimately have to win by the laws of probability, even if you lack the capability.",
        "date": "4mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQHlt9JKAlBG7w/feedshare-shrink_800/0/1707744894872?e=1722470400&v=beta&t=lsQB9qFdBF6DZttNTLeJ0K8Ku06dDQHfhsAuJdpNu78",
        "likes": "107",
        "commentsCount": "5 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-02-02 13:40:52",
        "content": "Sending out \"quotations\" has never helped us in winning a client. That's a game that we are bound to lose, and we have kind of accepted that harsh reality. \n\nThere is always someone willing to sell cheaper. Always someone willing to take that financial hit, maybe for the sake of \"portfolio\", to help them get started or maybe for some other genuine reason. And I don't blame them for it. Everyone choose how to best run their business.\n\nOur Unique selling point, is:\n\nOur Quality.\nOwnership.\nOur love for the trait.\n\nSomeone will ask: \"Quality? So you are saying you guys provide the best possible quality?\"\n\nNope. That'd be a lie. But we provide \"our\" best possible quality, and that has satisfied and helped succeed over 90% of the clients we have worked with. No I won't say 100%, nothing is 100%, that'd be another lie.\n\nWe are not the ones to win the \"price wars\".\n\nIs that bad for business? Maybe.\nWill that help us keep the best talent, maintain good incentives and deal with good clients? Absolutely!\n\nAnd we are happy with that.",
        "date": "4mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQGDaIj5sqVFmw/feedshare-shrink_800/0/1706881250900?e=1722470400&v=beta&t=3ufJnHv_5xToFZXPDVGuk2Ynjals203b7bgFgzFGBHU",
        "likes": "92",
        "commentsCount": "8 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-02-01 11:02:44",
        "content": "👇🏻Me, whenever someone asks me how it's going...",
        "date": "4mo • \n ",
        "image": "https://media.licdn.com/dms/image/D5603AQGtYzWdil1lGQ/profile-displayphoto-shrink_100_100/0/1671485532644?e=1724889600&v=beta&t=EfLGr5x7YeVuBdgmPEljDjBGr6g-BWXI8dQ1xbBXcbM",
        "likes": "18",
        "commentsCount": "",
        "sharedBy": "Andrew Gazdecki",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:7153860062489333761/"
    },
    {
        "postTime": "2024-01-28 13:46:04",
        "content": "Startup ecosystem is growing in Pakistan everyday and the opportunity is too big to skip. So glad to see entrepreneurs, startups, businesses, from around the world, travelling all the way to Pakistan 🇵🇰 to explore the local market.\n\nGot the chance to attendbyover the weekend and met some great people. Couldn't have spend the weekend in a better way.",
        "date": "4mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFM0fje_qchPg/feedshare-shrink_800/0/1706449560460?e=1722470400&v=beta&t=07Hpcl_pKEWcKvNyVMIgaV24LEUFX8lXRj2dGIzQtqk",
        "likes": "76",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-01-22 18:55:00",
        "content": "Winner don’t blame, they own - are you working with winners?\n\nWinners don't rely on others to win. They have their own plan, and choose the people who they think can help them win. If one of the actors is not going according to plan, they assess, try to help and if nothing works, they move on and find what's going to work for them.\n\nIt might be a bit ruthless for you, as the vendor, but for your customer, it's the only thing that'll make their business successful.\n\nAnd you really, ONLY, wanna work with the customers who are eager to make their business successful.\n\nFocus on this and it'll push you towards excellence. A win-win for everyone.",
        "date": "5mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQGLH-_rou7WGA/feedshare-shrink_800/0/1705932406466?e=1722470400&v=beta&t=aME698NKK_dF41ec_KFeFO9P3V9hsTSeIea4mqDp8JE",
        "likes": "16",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-01-21 18:24:03",
        "content": "Choose to work with “winning” customers. Why?\n\nThe same reason why universities and colleges grant scholarships to the good performers. They are betting on winning horses.\n\nThe customers with the winning attitude will become your recurring clients at the end. Their business will thrive, the work you’d have done for them and the relation you’d have built with them will result in recurring business.\n\nIt’s really hard to ensure sustainability if you choose work with just about anyone and everyone. They’ll lose because of their own incompetencies, and will blame you for not being able to make it big.\n\nChoose very carefully who you do business with.",
        "date": "5mo • \n ",
        "image": "",
        "likes": "23",
        "commentsCount": "7 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-01-18 13:38:55",
        "content": "\"How do I know if I am taking all the right decisions?\" \n\nYou won’t. \n\nAnd you’ll mess up hard.\n\nAnd you’ll learn.\n\nAnd next one will be a bit better than the previous one.\n\nYou can read all the best books in the world, listen to all the wisest people in the world, watch all those intellectual podcasts, but you won't learn your lessons until you've faced those issues yourself.\n\nYou really have to walk that road yourself, face those challenges, take the hit on your face and then try to figure out how to get out of that situation.\n\nReading books, listening to people and asking for advice, these things help, as long as you are taking the actions yourself. You are never going to figure out that \"winning formulae\", copy it, and make it big.\n\nIf that were the case, all those big investors would be replicating their money by betting on same formulae again and again.\n\nIt's more about the \"executor\" than the \"execution\"\n\nYou won't figure out what you did different, it can be a random candid conversation with someone that can help you close a deal of the lifetime, or it can be the result of all that hard work of yours.\n\nAnd the sad part, if the luck isn't with you, all that hard work and all those \"strategies\" are not going to work anyway.\n\nSo do what's in your control, do it consistently, and hope something sticks.",
        "date": "5mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQHgkypj0i9DRA/feedshare-shrink_800/0/1705585134077?e=1722470400&v=beta&t=AylYCjTC_Y2tCuJK0hy6Egl56FY47FSrYyOIMp5ODFY",
        "likes": "41",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2024-01-15 09:58:00",
        "content": "I built the very first version of RipeSeed's website in 2 hours using Webflow.\n\n6 months and 6 team members later, we re-developed on Gatsby in a week.\n\n2 years and 25 team members later, we re-developed in NextJS, in over 2 months.\n\nStart small. But start.",
        "date": "5mo • \n ",
        "image": "",
        "likes": "88",
        "commentsCount": "4 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-12-31 09:45:08",
        "content": "100% agree with this. The term \"family\" has been coined so much in the industry that sometimes I just unknowingly, not intentionally, use this term, but try to correct that immediately.\n\nperfectly sums it up here. It's not a family. It's like a sports team.\n\nYou gotta do your best. You are appreciated for your hard work. But the team spirit keeps you in the team even if you mess up sometimes. Though you have to work hard and fight for your place in the team every year, or else, you will be replaced by someone who deserves it.",
        "date": "5mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D03AQHeZM6b4xOT8w/profile-displayphoto-shrink_100_100/0/1715841424447?e=1724889600&v=beta&t=YPyRP9DVN_LvbB0xU7FvHdgEHh_KrI_w-2JRoN2Gfzo",
        "likes": "19",
        "commentsCount": "8 comments",
        "sharedBy": "Linas Beliūnas",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:7145505038910631936/"
    },
    {
        "postTime": "2023-12-29 12:55:40",
        "content": "2023 - The year when:\n\n🙋🏻‍♂️ I started posting about my journey - now you all know me!\n\n🛫 Traveled 4 times, twice for business networking - made some good friends!\n\n👨🏻‍🦲 Our headcount increased to 28 people!\n\n💹 $700k+ in revenue and 100+ projects completed on- and we became expert vetted as well!\n\n💰 Company-wide increments (for the first time since we started), and delivered timely bi-annual bonuses, despite recession\n\n🎥 Started working on content strategy of- now we are producing valueable content, reels, blogs, on regular basis - Go check us out!\n\n🧪 Hired and partnered with sales resources and companies from Germany, Netherland & US\n\n📚 Started reading more frequently, completed 3 books, (bought 6, yeah sorry xD)\n\n🤝 Took sales more seriously, actively started exploring partnerships and collaboration opportunity\n\n🧠 Finally got myself to start working on some products - stay tuned for what's coming!\n\nAnd nope, if you told me at the start of 2023 that I'll be making a post at end of year, with everything I mentioned above, I wouldn't believe you. All of this wouldn't have been possible without the amazing team we've been able to build, the partnerships and longer term client relations we've made.\n\nLooking forward to 2024 and what this coming year holds for us!\n\n#2023",
        "date": "5mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFclBYfyNQ5Tg/feedshare-shrink_800/0/1703854539522?e=1722470400&v=beta&t=31y7VDydVbaVIQ-Ow3MkirMHE2ZfefIcTolBG7Ybz8Q",
        "likes": "186",
        "commentsCount": "19 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-12-28 15:38:20",
        "content": "There's no valid justification of building an overly engineered product. Premature optimization is the root of all evil.\n\nRebuilding and rewriting software is normal. No one can predict what your user is going to need two years down the road.\n\nSo let's avoid making engineering decisions by taking assumptions too far into the future.",
        "date": "5mo • \n ",
        "image": "",
        "likes": "40",
        "commentsCount": "5 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-12-27 15:17:06",
        "content": "No amount of marketing, solves a bad product! \n \nI heard this in a Gary Vaynerchuk video a long time ago and it got stuck with me. You can have the perfect logo, a video that catches your audience's attention right away, a PR strategy that shapes the narrative of the audience for your product, exactly as you want, but at the end of day, when your prospect converts to a customer and the product or the service doesn't deliver what was promised, they'll go away, very frustrated with your reputation shattered.\n\n\nIn the journey of any startup or any product, you are always inclined towards doing the “cool” stuff, because everyone else is doing it. You wanna have a podcast to represent your product, a team building nice videos with prototype of your app, a sales team going on events and posting pictures with high profile clients, and while focusing on all of this, you fail to focus on the most important thing, the product itself.\n\n\nIn the initial days of any startup, you really need to focus on:\n\n\n🛠 Building the product in the right away\n\n🤝 Focusing on the customer’s pain points\n\n📈 Targeting small achievable goals\n\n😇 Do not market what you are not going to ship\n\n🙌🏼 Saving yourself from the peer pressure of doing the cool things\n\n\nDo this, build a good product, and then you can go as crazy on the marketing as you want to.\n\n\n#business#softwaredevelopment#saas\n\n---------------------------------------------\n\nI am posting my journey of building, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "8mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4E03AQF5iOwHjAfBGg/profile-displayphoto-shrink_100_100/0/1678167415920?e=1724889600&v=beta&t=LapSxPdtX2ZAlf59-Avnshuo15pmML6kptdZglKTX8o",
        "likes": "50",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-12-26 09:49:57",
        "content": "Your perfect product isn't gonna sell itself. \n\nLaunch an MVP or just a simple waitlist, and see if anyone needs your product.\n\nSo many people just go down the rabbit hole of building indefinitely without having a single customer.\n\nSome of the best clients we've had were the ones who were good with selling the products we were building for them. And we always love working with such client. Knowing that what you build will be used by people and will make some lives easier.\n\n#saas#sales#development#engineering#entrepreneurship#solopreneurship#makers",
        "date": "6mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQEcCE6Ugb58Sg/feedshare-shrink_800/0/1703584196026?e=1722470400&v=beta&t=wgAkDgnUQ9COh-DOS4WBms4FyGBhP393lLzFLW7K6dw",
        "likes": "47",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-12-22 13:56:02",
        "content": "The biggest mistake Non-Tech founders make is, they have an idea, they don't write it down to the finest detail, and expect some freelancer/company to read their mind.\n\nAs a Non-Tech founder, you have the leverage of thinking freely without any technical constraints.\n\nI'd recommend staying that way.\n\nNote down everything you have in your mind, create rough wireframes, create your whole vision, the user journey, the user experience on a piece of paper. Don't worry about what's technically possible. Take a piece of paper and go crazy. Let the tech guys worry about what's possible and what's not.\n\nSome of our best clients are Non-tech founders, and some of the worst experiences we've had are with Non-tech founders as well. The difference? The good ones clearly communicate each and every requirement and don't run on assumptions. The not-so-good-ones will just assume that since they've asked you to build a chat app, you'll have all the features of WhatsApp, stories, audio notes, Voice & Video call, already baked in.\n\nSoftware engineering and product development is an art. And an artist will only be able to draw what you ask them or show them. Nothing more. Nothing less.\n\n#nontech#founders#development#engineering#nontechfounder#saas",
        "date": "6mo • \n ",
        "image": "",
        "likes": "29",
        "commentsCount": "5 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-12-21 13:21:17",
        "content": "\"I can either do so many things, or nothing at all\"\n\nI battle with this everyday. \n\nMy day starts, and I have too many things to do.\n\nI can focus on sales and outreach and build my network through all those channels I am experimenting with these days.\n\nI can focus on those two really interesting SaaS ideas that I really wanna work on.\n\nI can work on my personal branding.\n\nI can work on planning the upcoming content for company's social medias.\n\nI can read that book, recommended to me by 3 people, that's waiting on my table for a bit too many days now.\n\nI can reach out to potential partners for collaborations.\n\nI can work on improving and streamlining the sales process.\n\nOR.\n\nI can do nothing at all.\n\nI can just keep thinking about all of these things.\n\nBattle with what I should do today. What I should do tomorrow.\n\nAnd the day ends.\n\nYup, I know the answer is focusing on one thing at a time. Delegating things. Dividing my time. Prioritizing things, but it's easier said than done.\n\nWorking on it...\n\n#entrepreneurship#agencylife#focus#productivity",
        "date": "6mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQGtumtajyW6jA/feedshare-shrink_800/0/1703164875729?e=1722470400&v=beta&t=MTJHAAQQNr7Mehb6hd2zxtbDZFk_S0ZuUUsLPCjh5JA",
        "likes": "65",
        "commentsCount": "6 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-12-21 09:56:37",
        "content": "It's hard. It's risky. The most accurate representation...",
        "date": "6mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4E03AQGHPXtvOvN-cQ/profile-displayphoto-shrink_100_100/0/1693057815904?e=1724889600&v=beta&t=wPoj027AZRlMnizZiSQXMylGr0DJ1MXnIbko7yJ2H6M",
        "likes": "15",
        "commentsCount": "",
        "sharedBy": "Florian Huber",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:7143523301263417345/"
    },
    {
        "postTime": "2023-12-20 14:23:40",
        "content": "\"I can do engineering. I'll just hire someone for sales and it'll be taken care of\"\n\nNOPE.\n\nIt's really hard to delegate something that you are not good at yourself. Not saying it's impossible, just really really hard.\n\nIt was always easier for me to build an engineering team, create good engineering processes, because I was going through all of it myself. I knew ins and outs of engineering, the issues faced by engineers, and what makes a good software product. My expertise in it helped me delegate the engineering easily. I won't say I have mastered it, there's a lot of room for improvement, but it's working.\n\nBut sales!\n\nIf there's anything I have been focusing on for the past two and half years, it's sales. I have been learning about sales, trying out new techniques, reading new books, learning about how to pitch, how to present myself and the brand. You have to learn ins and outs of the sales to properly run a business.\n\nI mean, of course you can hire VP of sales having 10-20 years of experience, but as an initial stage company, you can either not afford that at all, and even if you can, and you are relying on that one individual to bring in cashflow to the company. Congrats, you have just gotten yourself into a bigger problem.\n\nSustainability of YOUR business now lies in the hands of one person, which is not YOU.\n\nIt's a hard to swallow pill, but if you have stepped into business/entrepreneurship, sales is the going to be the only thing that's either going to help you scale, or hold you back. And you want to make sure that you know, of all people, how to do it. You have to show it to your team that:\n\n1. It's possible\n2. YOU are able to do it, if no one else can\n\n#sales#agencylife#marketing#entrepreneurship#business",
        "date": "6mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQGqUpVruD0kJQ/feedshare-shrink_800/0/1703082219198?e=1722470400&v=beta&t=xkTeMgKKmjk8cPtEiWfR03iyR6unbMm-bDke3VyhMnU",
        "likes": "48",
        "commentsCount": "10 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-12-18 14:14:23",
        "content": "\"How do I know if I am taking all the right decisions?\" You won’t. And you’ll mess up hard. And you’ll learn. And next one will be a bit better than the previous one.\n\nImagine how boring of a story would it be if all your decisions were right.\n\n\"Hey! Yeah so I left my job, reached out to 2 people, both turned into clients, and now we have a team of people and we are growing everyday.\"\n\nNo blocker, no hiccups, no downs, only ups and successes.\n\nThat might have been the case for some, but not for the majority. And that's like the vetting process of entrepreneurship. These difficulties and challenges prepare you for the reward, keep you humble and on ground.",
        "date": "6mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQHXcnhOX3Ji7Q/feedshare-shrink_800/0/1702908861852?e=1722470400&v=beta&t=KZg49Ips-lVjtwHxjd6W2BLkTpDf8kojeenrUn-jEbY",
        "likes": "52",
        "commentsCount": "3 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-12-15 12:38:33",
        "content": "\"So what keeps you going?\" This.\n\nhashtag\n#motivation \nhashtag\n#agencylife \nhashtag\n#entrepreneurship \nhashtag\n#buildinginpublic",
        "date": "6mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D0BAQHqCkXj3H3aRA/company-logo_100_100/0/1694153319080/ripeseed_logo?e=1727308800&v=beta&t=57r4mWIxhJW23i36Fl9OmzbkraNwuWhmDxspbMfoxYY",
        "likes": "9",
        "commentsCount": "",
        "sharedBy": "RipeSeed",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:7133416426635206656/"
    },
    {
        "postTime": "2023-12-14 14:01:34",
        "content": "Trust goes both ways - Do you really trust your team? If not, how do you expect them to trust you?\n\nYou cannot build a trustworthy team with motivational speeches, pizza parties & cool hoodies. You build trust the by showing them that you trust them.\n\nFrom very early days, I started engaging the team members directly with the clients. The team members working on the project talk to the client directly. No middleman. And I received some really good response from my team about this. They were surprised that the company was entrusting them with so much responsibility and giving them ownership.\n\nAnd the result? They tried to protect that trust with the core of their hearts.\n\nHow do I know that?\n\nTwo of our clients tried to offer direct employments to our team members, and my team members reported that directly to me. I never intervened. I let the team member handle it by themselves. They told them it'd be a breach of contract and violation of rules.\n\nI also started trusting my team, from very early on, with company financials. The team prepares financial estimates for the projects, they know what kind of projects we work on, what we charge, and they negotiate with the client on behalf of the company as well, taking client through the whole journey, from discovery, till closing.\n\nAnd this trust has allowed me to unlink myself from day to day of the business and delegate the responsibilities to my team. It's because of this trust that I have been able to travel abroad 4 times this year, and there was no disruption in the work we were delivering to the client and in closing new clients.\n\nI am able to experiment with different ways of sales, growing business, personal branding - just because of this trust, that:\n\n👇🏻 they've got me covered 💯",
        "date": "6mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQGC2l3-YW_bVg/feedshare-shrink_800/0/1702562493006?e=1722470400&v=beta&t=xzcuwIAkA8044sp7DFjopxKFuUlJ9StxNt5ql8MQ79s",
        "likes": "63",
        "commentsCount": "6 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-12-13 14:35:53",
        "content": "The biggest sin of entrepreneurship? Thinking that you've figured it all out. \n\nThe moment your brain starts tricking you into thinking you've figure it \"all\" out, Be Alert!\n\nThat might have been a dumb luck, maybe beginner's luck, or a random shot in the dark.\n\nOr maybe you might have figured that out for that one particular situation or some specific span of time or for a particular scale of problem.\n\nThe problem will keep evolving, keep getting harder and harder, and as you start to grow, the scale of the problem and the effects that the problem will have will keep getting bigger.\n\nHope for the best, plan for the worst.",
        "date": "6mo • \n ",
        "image": "",
        "likes": "21",
        "commentsCount": "5 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-12-12 07:21:20",
        "content": "We all have had clients like these...\n\nhashtag\n#clientstories \nhashtag\n#justclientthings \nhashtag\n#worklife \nhashtag\n#agencylife \nhashtag\n#ripeseed",
        "date": "6mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4E03AQF5iOwHjAfBGg/profile-displayphoto-shrink_100_100/0/1678167415920?e=1724889600&v=beta&t=LapSxPdtX2ZAlf59-Avnshuo15pmML6kptdZglKTX8o",
        "likes": "14",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-12-11 13:00:42",
        "content": "I underestimate all the events I plan on going to, and I keep getting surprised by the amount of value I get out of these events. Attended two such events in the past two weeks, and I think I couldn't have utilized the weekend in a better way.\n\nPakistan has been progressing in tech and business a lot in these past few years, and every day, we see new products and startups, coming up and solving business and consumer problems.\n\nAnd most of the time, these startups are working silently, running small but profitable businesses. We only hear about the ones who appear on the news or blogs, who raise funding from the VCs, but never hear about these ventures, bootstrapped by people on their own, running a sustainable and profitable operation.\n\nVisited this session arranged bythis weekend and met some amazing bunch of people, exchanged contacts and hoping to partner up on a few things.\n\nGreat to see the workis doing atand the problems they are solving for entrepreneurs in setting up their e-commerce stores.\n\nAmazing to listen to's journey of building, the problems she faced in the early days, and how she built a brand identity for the quality of work they are producing.\n\nTruly enjoyed the talk delivered by, about her expertise in Copywriting, and how she built a business out of something she started part-time as a freelance thing.\n\nHope to attend more of these from now on!",
        "date": "6mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQHcozlQDod-wg/feedshare-shrink_800/0/1702299640437?e=1722470400&v=beta&t=LsDtpzose8Gp0n5A5O-ZMaP0e5tHtU__4we7vvRKisg",
        "likes": "73",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-12-08 14:16:35",
        "content": "Software Development can get pretty damn depressing!\n\nIf you are not passionate about it, or more importantly, if you are not committed enough, you can lose motivation pretty quickly.\n\nEasiest way to regain your motivation? Rest. Take some time off. Your productivity will sky rocket, your motivation will be back.",
        "date": "6mo • \n ",
        "image": "",
        "likes": "42",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-12-07 13:20:06",
        "content": "Making excuses is a luxury.\nAnd not everyone can afford to have that luxury. \n\nYou lose this luxury when you feel you are accountable for your actions\n\nYou lose this luxury when you can see your actions can affect the lives of hundreds of other people, directly or indirectly\n\nThink of it as a blessing, or think of it as a curse, it's on you.",
        "date": "6mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFCBuUznZiiPA/feedshare-shrink_800/0/1701955205163?e=1722470400&v=beta&t=EWLqt_XdWPFrjwgc3hdCpjdkD3ECr7YXC9n9cUKIA_w",
        "likes": "28",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-12-06 15:07:50",
        "content": "The Failure Story - When I lost my years of hard work and a few thousand $$$, because of a single client 💔\n\nMy freelance journey started within the last year of my University, and it went decently well. I was usually overburdened with the amount of work, so I was handing it off to my friends most of the time, so much so, that at one time, there were 10 projects in progress and I was working on none of them, all being done by my friends. And yes, the process was always transparent and the clients always knew who was working on the project.\n\nWe had a client who wanted us to build web scrappers for him. I started working on that with my friend. We completed more than 10 projects for him and worked with him for over an year. Ultimately, the scrappers started breaking because of various factors. The client started arguing every other day and it seemed like it'd end one day or the other. So one day, I gathered some courage and told him it's not working out for us anymore and we want to end the contracts, even the ones currently in progress that we have worked on. He agreed and ended the contracts.\n\nNext day, I received a bunch of notifications.\n\n\"Your project has been cancelled\"\n\"Your project has been cancelled\"\n\"Your project has been cancelled\"\n.....\n.....\n\nThe client had reversed the payment for all of the work we had done for him over the past year using Paypal chargeback (Google about it and you'll find a lot of victims of chargeback)\n\nI used to withdraw funds from my account every few weeks, so the account only had around $1000 at that time. I lost that amount, plus my account went in negative. Which meant, if I work on any new projects, the earning will be eaten away by the negative balance.\n\nIt took me 2 years to build that account. So many 5 star reviews. All lost, because of 1 bad client. I reached out to support and asked them to check all the 5-star reviews that the client had given us over the past years, but they couldn't do anything because it was a chargeback. It was out of their control (they could file a dispute to Paypal, but I guess they just never bothered)\n\nI had a good enough stream of income at that time, but everything was killed by one client. I was never able to recover that account again, but I had a few clients outside of the platform, so I kept working with them as well.\n\nNow when I look back, I think it was for the good.\n\nI would have never tried Upwork, if my Fiverr account was fine.\nI might have never started RipeSeed, which mainly started as an Upwork Agency.\nI might have never been able to run an agency of 28 people.\n\nAs heartbreaking as that was at that time, I think that was a key factor in who I am today.",
        "date": "6mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQEmiHtBrhP8PQ/feedshare-shrink_800/0/1701875268732?e=1722470400&v=beta&t=r17Q5KoASuxEtxe23LAVvY_5XCWfl2nzOcEfVrhLIzk",
        "likes": "674",
        "commentsCount": "51 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-12-05 14:19:36",
        "content": "Why I am working as a solo founder and don't have partners? I get this question a lot and was planning to document the answer in a post, so here it goes.\n\nKnowing myself well enough, I think I'd have messed up the partnership myself if I had one. Different people have different energies and I think it'll be hard for me, personally, to match my energies with the other person, hence resulting in conflicts later on.\n\nNow, what are the benefits of not having partners:\n\n- Faster Decision Making ~ I can quickly make good/bad decisions, if that works, great, if not, I can pivot without any long discussions.\n\n- No judgments ~ Accept it or not, the human mind does not like to hear no for an answer. If you give an opinion to your partner and he/she says no, the next time, you'll think twice about giving an opinion, which will hinder experimentation.\n\n- Not relying on anyone ~ If I know I am the only one, I'll have no option, no excuse, for not doing something. Sales, engineering, planning, marketing, I know I am the only one responsible. I won't be relying on anyone else.\n\n- Talking less. Doing more ~ I mean, we all love making plans. Romanticizing about the future and the possibilities. Daydreaming. And sometimes, these things start taking up too much of your time. When your partners are your friends, sometimes it can take too much time \"making plans\", and less time \"executing them\"\n\n\nHowever, I think partnerships can be great if done right. Whenever someone asks me, whether or not they should do partnerships, this is what I recommend:\n\n- Build alone. Then merge ~ This will help both of you to validate that you can build something from the ground up. Build something small, make it profitable. Once both of you validate your capabilities, then you can merge. This is especially helpful if both founders have the same area of expertise, which is mostly the case.\n\n- Split responsibilities ~ This helps you stay clear about which person is accountable for which part of the business. If both of you are doing exactly the same thing, one of them will have the leverage to slack off, with the excuse of \"It's being done by him anyway\"\n\n- Make sure your goals align ~ Every individual has personal goals. With partnerships, you have to make sure that those goals, either align or do not come in the way of your mutual goal.\n\n\nHaving partners is great. You can have someone to share the good and bad times with because you cannot always share those successes and failures with your friends and family. But you have to know yourself well enough. If you think you think you can perform well under a partnership, go for it. Everyone paves their own road to their goals. There is no, one, well-defined recipe for success. Have faith and take the leap 🚀",
        "date": "7mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4E03AQF5iOwHjAfBGg/profile-displayphoto-shrink_100_100/0/1678167415920?e=1724889600&v=beta&t=LapSxPdtX2ZAlf59-Avnshuo15pmML6kptdZglKTX8o",
        "likes": "58",
        "commentsCount": "4 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-12-04 14:10:07",
        "content": "A step-by-step guide on failing miserably at launching a SaaS product:\n\n🧠 Don't share your idea with anyone, don't validate it at all. Your idea is precious. The moment you share it, someone else will develop it and make a couple million dollars.\n\n🛠️ Start with tens of features and don't launch until all of them are developed.\n\n🗑️ Have unrealistic expectations from your development team and push them to deliver results faster than possible. They'll build a bunch of unsustainable garbage so all your features are developed\n\n📣 Don't define a target market. Your product is for everyone. The whole world needs it. Don't narrow it down to region, industry, and age group.\n\n🚻 Have zero public presence. Don't market it on social networks. Just launch and wait for users to discover your product\n\nCongrats. You have successfully failed in launching a SaaS product 👏🏻",
        "date": "6mo • \n ",
        "image": "",
        "likes": "28",
        "commentsCount": "8 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-12-01 13:38:17",
        "content": "No one starts with a rock-solid process. But you gotta start somewhere. A bad process is better than no process at all. \n\nAnd sometimes, having a process can be something as simple as just staying consistent with whatever you are doing.\n\n1. We do twice a week sales meetings, sometimes they feel a bit redundant, but consistent meetings allow us to catch any issues right away. If there is lack of leads generated in any particular week, we all come together and see what we can do to improve it, and most of the time, some minor changes in strategy produce great results.\n\n2. We created our own process of handing off leads from sales to the technical team, it took a few iterations and now the process is pretty solid and the client hardly ever feels inconvenienced with the hand-off.\n\n3. In the early days, we started using Notion to manage all the projects, creating tickets and managing a whole task board in a notion doc. Some might say it's not a \"good practice\", you should always use Jira/Asaana/Trello, but one of our clients, who had the experience of working with a team much bigger than us, complemented as \"You guys are much more organized than the previous ones\"\n\n4. Being an AWS enthusiast, I started training everyone on AWS myself from day one, whenever we hired someone. I created a basic training document and shared it with the team. The team then started training new joiners based on that doc, and kept improving and working on that doc as well. And now we have training docs for AWS, Web 3, Advanced React Training, and many more.\n\nThere is no single formula that can work for everyone. You might have to just create your own recipe, stay consistent about it and make it work. You will never know if something is working on not if you are not following anything consistently.\n\nCreate a process. Stay consistent.\nIf it works, great.\nIf it doesn't, pivot.\nRepeat.",
        "date": "6mo • \n ",
        "image": "",
        "likes": "37",
        "commentsCount": "8 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-11-29 11:49:47",
        "content": "Oh no, it's not stressful at all!\n\n- Yeah two of our clients have been delaying payments for almost a month\n\n- No that client we sent multiple proposals to, said his project is going on hold for now\n\n- Yeah one of our excellent team members just got an offer from some other company\n\n- Oh and we are going to be over-charged for our office electricity bill because the meter is malfunctioning and the officials are not fixing it\n\n- And a client is increasing the scope of work and not agreeing to pay for the additional time we'll need to spend on it\n\n- Yeah that resource who was going to join us tomorrow after their 1 month notice period is now ghosting us\n\n- And that client who was expected to last for 4 months is now leaving after 1 month\n\nBut yeah, all good. Not stressful at all!",
        "date": "6mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFgX5GnFxqhng/feedshare-shrink_800/0/1701258586803?e=1722470400&v=beta&t=1JY-RkwGkiHYtUHK785MgppblJQFKZGa3WZzu3cIVZc",
        "likes": "106",
        "commentsCount": "13 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-11-28 13:46:15",
        "content": "An app I built, in 2 hours, ended up hitting 150k+ downloads 🚀\n\nBack in 2017, I got this new phone, it was Motorola Z Play I guess. It had a flash for both front and back cameras. Pretty cool. I tried looking for apps that could turn on both flashlights at the same time, and I found none. So I decided to build one on my own.\n\nCreated some simple designs in Photoshop, developed the whole app in like 2 hours, and just released it. It worked on my phone, so I thought, “Good, one more app in the portfolio”. Didn't think of it much at that time.\n\nA few days later, I decided to post about it in some forums like XDA Developers. No paid marketing or any ASO. I hardly knew anything about ASO at that time. Fast forward a few weeks, and the app got like 50k+ downloads 🤯 I wasn’t expecting that at all. Then I checked back again in a few months, more downloads, and to this date, the app has gotten 150k+ downloads 🎉\n\nHow? Don't know. Organically, maybe some XDA users, or maybe because I decided to randomly build some stuff, without overthinking about design, perfection, or any marketing, and launched right away. It's still live on Play Store 👉\n\nHope this gives someone enough motivation to start working on that hobby project of theirs that they have been thinking about for a long time!!",
        "date": "6mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFewadxiDZ0WQ/feedshare-shrink_800/0/1701179174497?e=1722470400&v=beta&t=RZN2NgqTWD2Qfnt1MJpnhM2t99FU3rpXle-9K4_TLlA",
        "likes": "293",
        "commentsCount": "9 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-11-27 13:23:51",
        "content": "\"Taking a break\" always works. It has happened to me so many times that I have lost count. \n\nWhen we are on a problem for a long time, without any breaks, our mind stops thinking of new ways of solving that problem. We start losing motivation and imposter syndrome kicks in Real fast.\n\nThis happened to us recently in one of our projects where we were stuck on a problem and despite a lot of efforts, we were not able to figure that out. We decided to take some rest. Despite the urgency, we decided not to spend any time trying out different solutions, over the weekend. And guess what happened?\n\nI received this message fromin the morning. He figured that out. Proved the hypothesis one more time. Looks like we'll need to document this \"debugging method\" in the project Readme as well ✌🏻",
        "date": "6mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFyqIgPqUO-dQ/feedshare-shrink_800/0/1701091429789?e=1722470400&v=beta&t=FOhxQifnCQEXOW3RIKSi_BRY9P2h_plMd2cxndGxFBg",
        "likes": "63",
        "commentsCount": "7 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-11-25 19:14:48",
        "content": "Truly tragic incident 💔",
        "date": "7mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D0BAQGQ0PxfPK-00Q/company-logo_100_100/0/1704698768584/purelogics_logo?e=1727308800&v=beta&t=wO4iW5IKs5HMYcCFjMTP16F6EtsQhwaXXm7f0uVlkyQ",
        "likes": "7",
        "commentsCount": "",
        "sharedBy": "PureLogics",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:7134191352459767808/"
    },
    {
        "postTime": "2023-11-23 12:30:10",
        "content": "How waking up early for a client, helped build a relationship worth $50k+\n\nSix months into's journey, I got to talk to an Australian Health Tech giant, having a big team of developers and researchers. They were planning to automate a huge manual workflow that was consuming billable hours of their own engineers. After a couple of meetings, they agreed to work with me - with one condition. They wanted me to be part of their standup call and needed an overlap of 5 hours.\n\nAustralia is 5 hours ahead of us, which meant I had to be in the meeting at 8:00 AM in the morning. Which also meant that I had to wake up at 6:30 AM, get ready, have breakfast and travel to office, so I can attend the meeting at 8 AM. And I am not an early riser. I can sleep as late as 4 AM, but I can't wake up easily. (Not proud of it)\n\nBut it could be our first enterprise client if I could handle them correctly. So I signed up. Every day in the office, at around 7:45 AM, attending the meetings, working on automating the workflow, establishing a good relationship with our point of contact and the team on their side, and after about a month and a half, we were able to deliver the solution that they hired us for. The engineering manager who hired me showcased workflow in a company-wide meeting and everyone just clapped. And I had never seen them clapping in any of the meetings before.\n\nIt established a strong relationship and trust. The initial contract ended in 3 months, but we stayed in touch if they needed anything from me. And then after 3 more months, they reached out again, with the need for a Senior Full Stack engineer, and we were able to assign one of our team members to work for them. And it seemed like that effort of waking up early was finally paying off.",
        "date": "7mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQH-UP0Yxsm2RQ/feedshare-shrink_800/0/1700738697571?e=1722470400&v=beta&t=Y49bC1mJ0aAHomMgnE_lrGoxnfUpr17oEVv-LTE9Au8",
        "likes": "191",
        "commentsCount": "14 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-11-22 14:33:44",
        "content": "I rely on Notion heavily for my day-to-day workflow. And have been relying on it since day one. \n\nIt's critical to start organizing things from early on, because if you don't, things get messy, sooner than you can realize.\n\nI wanted to make sure each and everything I was doing, related to HR, Accounts, Engineering, and Sales, was documented. Now I could either buy a separate SaaS tool for each of these things, or I could just create my own workflow in Notion, so that's what I did.\n\n1. Instead of using Jira, I started managing projects on Notion, using their Task Board component. I could filter the tickets, assign different tags, assign to different team members, add details to each tickets and comment on them as well. Everything that a basic task management tool should do.\n\n2. Instead of using an HRMS, I used Tables component, added my comments, candidate's contact details, and their interview status using tags. I was also doing regular meetings with existing team members and taking notes in the HR document as well\n\n3. Instead of using a CRM initially, I created a document to add my notes of all the meetings I was having with the clients.\n\n4. When we built Sales and Client Success Team, I started keeping notes of my meetings with the teams in a Notion doc, so in every other meeting, we could revisit what we discussed in the previous one.\n\nAs we started growing, we did end up using a dedicated HRMS with more features, started using Hubspot to track leads and had a separate workflow for accounts, but to this day, everything that I am directly dealing with, goes in Notion.\n\n(This post is not sponsored by)",
        "date": "7mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQGY-W1Bm_3j6g/feedshare-shrink_800/0/1700663623400?e=1722470400&v=beta&t=0OtoteNEJ7DxU1tDjudf82nLjiCH0tkpoOHzkI-ioxw",
        "likes": "29",
        "commentsCount": "7 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-11-21 14:19:24",
        "content": "You are not the center of the universe, people don't think about you as much as you think they do!\n\n\nThe moment we truly realize this, we can do whatever we want, without worrying about the consequences a lot.\n\nMessed up a presentation? People might laugh for a few minutes and then forget. No, they don't think of that presentation every time they see you. It's just you overthinking. They have a bunch of other things to worry about.\n\nPosted something weird that doesn't suit your persona? People will just adapt to your new persona, might laugh for a moment, but they have a bunch of other things to worry about.\n\nSaid something you shouldn't have? Apologize. Move on. They'll respect you even more for apologizing.\n\nWanna try out something new? Go for it. If it doesn't work, pivot. No one has enough time to think that you are a loser.\n\nRunning out of ideas to post? Post something like this and come up with a better one tomorrow!",
        "date": "7mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQH4M0Gf-LXlBg/feedshare-shrink_800/0/1700576363897?e=1722470400&v=beta&t=l_r9KjCqwN-F88kaYZ6QpSHvl2wLmkMVelQTL05sNp4",
        "likes": "71",
        "commentsCount": "7 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-11-20 09:07:44",
        "content": "OpenAI fires Sam Altman - Microsoft hires and appoints him as the CEO of their AI division 🤝\n\nKey takeaways 👇🏻\n\nShape the narrative yourself 🗣️ Sam made sure he was known for the work he was doing. He became the spokesperson of the company, shaped the narrative in his favor, far before this drama started.\n\nBe a leader, not a boss 🤝 The president of OpenAI resigned after hearing the news of Sam being fired, a bunch of OpenAI employees showed support towards Sam. This kind of loyalty is only possible when you have been a good leader for your team\n\nTiming the opportunity 🕓 Microsoft could do a lot of things, put pressure on OpenAI board to appoint Sam back as CEO, threaten the board about weakening their ties with them, but nope. They played all the right cards, kept their ties with OpenAI and got Sam on their team instead. Satya Nadella proved himself once again (not that he needed to!)\n\nI think this was the most unexpected but exciting output. Let's see how it goes 🤞",
        "date": "7mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFCmqJqOZp2LQ/feedshare-shrink_800/0/1700471263360?e=1722470400&v=beta&t=yX9KqAh0d0O5Sh4819AkzcI-Ed8UWxG1PLWvt570aYY",
        "likes": "41",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-11-20 06:00:19",
        "content": "\"Owning the narrative\" is the key 🔑 Sam Altman might have saw this coming, so he started appearing in public events, became active on socials, and made sure that people associate OpenAI and ChatGPT brand with him.\n\nEven though Sam might have never coded or built anything at OpenAI, but according to public, No Sam means no ChatGPT.\n\nHe don't even need to fight for himself. The public and his team at OpenAI is doing that for him.\n\nIs that a coincidence? Nope. He made sure to publicaly associate himself with ChatGPT, and all that effort is now paying off.",
        "date": "7mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4E03AQGZ8tVFTF8_og/profile-displayphoto-shrink_100_100/0/1681130374527?e=1724889600&v=beta&t=TBGfdu9xD1furXd7HrRBwMw7lcYTeyTD7f_gjxe1qrs",
        "likes": "7",
        "commentsCount": "",
        "sharedBy": "Alex Lieberman",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:7132146847095099393/"
    },
    {
        "postTime": "2023-11-17 09:15:01",
        "content": "Progress ✅",
        "date": "7mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4E22AQF2QfnIlCezrw/feedshare-shrink_800/0/1700207994093?e=1722470400&v=beta&t=EQs4Cj6ROCqZ-bpFOXbAay8Ghwj78jjS_u3U_8uGfu0",
        "likes": "53",
        "commentsCount": "8 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-11-16 13:15:01",
        "content": "\"Follow-ups\" are crucial in sales and client communication.\n\n\"But, wouldn't that make me appear desperate?\"\n\nTo whom? Let go of that pride.\n\nWe acquired our first game development client solely because of follow-ups. This client was in talks with several other companies and was uncertain about the approach to their solution. After our initial meeting, we didn't hear from them for about 3-4 days. So I sent a follow-up.\n\nThe client responded right away. They weren't entirely certain if the final product would match their vision. They sought a quick prototype and tools to test their idea.\n\nAfter discussing this with my team, we proposed building a small prototype within a week for the client to validate the core game idea. They agreed, and we initiated a small contract. In just one week, our end result satisfied the client, leading us to secure the full contract to develop the game. That game remains in our portfolio, a showcase for our clients to this day.\n\nWithout that one game, we might not even have a game development team today. And where did it all begin? With that one \"follow-up.\"\n\nThis hypothesis was recently validated when we initiated an outbound email campaign. The \"Open Rate\" for the initial batch of emails was 5%, while the second follow-up achieved a 30% \"Open Rate\". The Sales Gurus in my network can validate this hypothesis.\n\nThe moral of the story: Always follow up ✅ Leave that pride at home when you step into sales.",
        "date": "7mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4E22AQE1RM-VBsTGEQ/feedshare-shrink_800/0/1700122857742?e=1722470400&v=beta&t=ywnJT67KNdR_3YNl_Z2EpPh2VfxbYyMVa2Uw-FHSaVw",
        "likes": "39",
        "commentsCount": "3 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-11-14 12:00:04",
        "content": "You never know, from day one, which client is going to be a long-term client. You have to just take your chances with every client you work with, provide the best service possible, and hope they turn out to be the good ones and appreciate your effort.\n\nThis client first came to us in February, earlier this year, and we started working on hisproduct idea. The initial version was released within 1 to 1.5 months and then we kept working on further iterations of the project. We formed a good relationship, based on the quality of our work and then he came up with another project and then another. So far we have worked on 3 of his projects, maintaining the previous ones, while working on his new ideas.\n\nWas there any strategy involved in specifically acquiring THIS 👇🏻 client? No.\n\nIt's the numbers game. You reach out to as many people as you possibly can, hoping they'd turn out to be the ones with good ideas and patience, and you just work with them. Some of them turn out to be longer-term clients like him, while some just give up.\n\nYou just have to make sure you are not the one who is giving up.",
        "date": "7mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQGgJbBNlJkbkg/feedshare-shrink_800/0/1699951862520?e=1722470400&v=beta&t=VH3YCJuBHlMSgTdAQgEtWw9O57JAjTq1JCwAaE2qlF0",
        "likes": "100",
        "commentsCount": "6 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-11-13 09:00:06",
        "content": "Had the chance to attend Payoneer Tech CEO Summit over the weekend. \n\nIt's great to see that the culture of tech summits and networking is growing in Pakistan and industry leaders are willing to share their experiences and the knowledge they have gained over the years.\n\nGreat panel discussion on the future of gaming industry in Pakistan byfrom,from,fromandfrom.\n\nPleasure to attend the Growth mindset session byand listen to the thoughts ofandfrom.\n\nHope to attend more of these in days to come.",
        "date": "7mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4E22AQH-2v176IOv8Q/feedshare-shrink_800/0/1699860304860?e=1722470400&v=beta&t=I4rTMrwdpnKY5vA9KszHDnKgSvBaSY4Zc8e-pYzZ-HY",
        "likes": "56",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-11-10 13:00:13",
        "content": "Don't get caught in the never-ending cycle of building features and never releasing 🔄\n\nWe have worked with clients who truly had some brilliant ideas, but could not put a cap on their ideas and thought every new idea they had, \"had to be in the initial release\", or everything we've built so far is trash. Kept delaying the release again and again, resulting in higher upfront investment, and increased chance of potential bugs that could happen because of unforeseen user experience issues.\n\nOn the other hand, we've also had the opportunity to work with some brilliant clients who:\n\n🔬 planned a minimal set of features for their initial release\n🚀 got the first version out in 1 month\n👥 worked towards acquiring users\n🤝 iterated on the next set of features based on user feedback\n💵 started generating revenue within a few weeks of launch\n\nDon't assume what your user is going to like. Just ask, and they might just tell you what they are willing to pay for.\n\nRelease as soon as you can. Build the core value that your product can provide, and that additional feature you very much want to have in your product can be added after the initial release is out. Best of luck 🙌",
        "date": "7mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQExvi2LYjLzzw/feedshare-shrink_800/0/1699612471312?e=1722470400&v=beta&t=4cvuDSVI08BmFfCp5rNTKJ_Pw1nxLFRZixc6i9l0Jr0",
        "likes": "39",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-11-08 13:00:07",
        "content": "\"So, I can go home and watch Netflix, but I cannot go home and freelance, is that what you mean?\"\n\nBack in 2019, when I was interviewing for a bunch of companies, I was always surprised when some interviewer or HR said:\n\n\"We don't allow freelancing\"\n\"We have a zero-tolerance policy on freelancing\"\n\nI was like, why? I can go home and play games, I can watch movies, but I cannot freelance? Doesn't make any sense. I want to work on my own thing, I have some personal goals, and I'll make sure that my freelance thing will not interfere with my day-to-day job. So why am I not allowed to freelance?\n\nIt never made sense to me. I got 6 job offers when I graduated, and I made sure to mention my preference to freelance in the interview. I wanted to make this stance clear. I was not planning to lie to the employer and do it anyway.\n\nIn 2021, when RipeSeed started, I started encouraging my team members to do their own thing if they wanted to. I always encouraged them to do freelance if that makes them happy. If they have their own product ideas, they are free to discuss with me anytime they want, and I'll be happy to help to the best of my knowledge.\n\nYou cannot build a great team if your team thinks you don't care about their growth. I am deeply thankful to each and every person working with me, for being with us and helping us achieve so much in the short span of two years. Helping them with their ideas, motivating them to do their own thing and guiding them selflessly is the least I can do for them.",
        "date": "7mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQHsnSrBI25S9Q/feedshare-shrink_800/0/1699444162398?e=1722470400&v=beta&t=GOwyIK5YZBEKzirWFl2Ef1WOM7OYcXQR4dLXctGeL3w",
        "likes": "79",
        "commentsCount": "8 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-11-07 14:26:37",
        "content": "\"We shall build good ships here; At a profit if we can, At a loss if we must, But always good ships\" - Collis Potter Huntington\n\nI read this quote a while ago and it stuck in my mind. An absolutely clear mission statement. No buzz words, no big promises, and especially, not aiming to be the best ones out there.",
        "date": "7mo • \n ",
        "image": "",
        "likes": "20",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-11-06 13:09:11",
        "content": "Why I am working as a solo founder and don't have partners? I get this question a lot and was planning to document the answer in a post, so here it goes.\n\nKnowing myself well enough, I think I'd have messed up the partnership myself if I had one. Different people have different energies and I think it'll be hard for me, personally, to match my energies with the other person, hence resulting in conflicts later on.\n\nNow, what are the benefits of not having partners:\n\n- Faster Decision Making ~ I can quickly make good/bad decisions, if that works, great, if not, I can pivot without any long discussions.\n\n- No judgments ~ Accept it or not, the human mind does not like to hear no for an answer. If you give an opinion to your partner and he/she says no, the next time, you'll think twice about giving an opinion, which will hinder experimentation.\n\n- Not relying on anyone ~ If I know I am the only one, I'll have no option, no excuse, for not doing something. Sales, engineering, planning, marketing, I know I am the only one responsible. I won't be relying on anyone else.\n\n- Talking less. Doing more ~ I mean, we all love making plans. Romanticizing about the future and the possibilities. Daydreaming. And sometimes, these things start taking up too much of your time. When your partners are your friends, sometimes it can take too much time \"making plans\", and less time \"executing them\"\n\n\nHowever, I think partnerships can be great if done right. Whenever someone asks me, whether or not they should do partnerships, this is what I recommend:\n\n- Build alone. Then merge ~ This will help both of you to validate that you can build something from the ground up. Build something small, make it profitable. Once both of you validate your capabilities, then you can merge. This is especially helpful if both founders have the same area of expertise, which is mostly the case.\n\n- Split responsibilities ~ This helps you stay clear about which person is accountable for which part of the business. If both of you are doing exactly the same thing, one of them will have the leverage to slack off, with the excuse of \"It's being done by him anyway\"\n\n- Make sure your goals align ~ Every individual has personal goals. With partnerships, you have to make sure that those goals, either align or do not come in the way of your mutual goal.\n\n\nHaving partners is great. You can have someone to share the good and bad times with because you cannot always share those successes and failures with your friends and family. But you have to know yourself well enough. If you think you think you can perform well under a partnership, go for it. Everyone paves their own road to their goals. There is no, one, well-defined recipe for success. Have faith and take the leap 🚀",
        "date": "7mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQEbCCJLnQ0n8Q/feedshare-shrink_800/0/1699274712410?e=1722470400&v=beta&t=v3d-LEt95X_k9I6EZHlpr1mLcxIkug7vQtDjknuHWn8",
        "likes": "58",
        "commentsCount": "4 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-11-03 14:25:29",
        "content": "I took a challenge to build 30 apps in 30 days, and spoiler alert, I failed 👎 \n\nBack in 2019, I had a good amount of time at hand and Flutter was pretty new in the market, so I thought I'd just learn Flutter by building small apps, that I can design, build, and launch, in a single day, all on my own.\n\nI terribly failed at that challenge, because, after just 3 days of working aggressively, I fell sick and couldn't continue anymore. However, I am so glad I took the impulsive decision to take that challenge.\n\nFlutter became part of my skillset, I started building apps for clients on Flutter, and to this day, all three of those apps are on Play Store.\n\nI wrote an article on the whole experience back then that you can read at:\n\nThat challenge was crazy enough already. But as the saying goes:\n\n\"Aim for the moon 🌙 If you miss, you may hit a star ⭐️\"",
        "date": "7mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQHD8rvAm1AxVQ/feedshare-shrink_800/0/1699021528198?e=1722470400&v=beta&t=UNDPQpa0eDFSvupGS-okUDJmIhKuv8E2_jfkLgNkLNc",
        "likes": "59",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-11-02 13:40:47",
        "content": "Unlinking yourself from the day-to-day of your business operations is the most critical thing you need to do!\n\nWhen we started, it was me:\n\n💰 Doing all the sales ----------------- 30%\n🎙️ Talking to all the clients ------------ 30%\n👨🏻‍💻 Managing all the projects ---------- 22%\n🏤 Hiring new people ----------------- 16%\n🧠 Thinking about how to grow --------- 2%\n\nThis is, percentage-wise, how my energy and thought process were divided. Notice what's wrong?\n\nI was engaged so much in the day-to-day of the business that thinking about how to grow and experimenting with new things was extremely difficult. But luckily, I was aware of this problem and I was aiming to get out of the day-to-day operations as soon as I possibly could.\n\nWith a bit of effort and spending some time, we were able to build a sales process, that could lift that burden off of me. The sales team was able to reach out to clients, just like me, and we were able to get leads we could convert into clients.\n\nThe next part took time, and it was the responsibility of getting on initial client calls whenever a lead was generated by our Sales team. I was partially worried, but not too focused on solving this problem. Until the end of last year, when I was about to get married. I figured if I didn't lift this responsibility off of me, it would either affect the business or my personal life.\n\nSo we built a Client Success Team, just 10 days before my wedding. A group of extremely talented, skilled engineers, who will be going on the initial client calls, and closing clients on behalf of the company, with the potential of getting bonuses for every client they close. Within a month or two, that team started closing clients, and those \"closers\" started managing their projects as well.\n\nThis has now allowed me to focus on the growth of the company. I have started learning more about sales, reading more books about how to grow the business, doing partnerships to spread the word about our services, attending more networking events, and of course, personal branding.\n\nSo right now, almost 90%, if not more, of my brain capacity is focused on growth and experimenting with new ways to generate sales.\n\nHope this helps anyone who's struggling with a similar problem and can motivate them enough to start focusing on unlinking themselves from the day-to-day of their business as well.",
        "date": "7mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQHtFmFcTHgEIw/feedshare-shrink_800/0/1698932445237?e=1722470400&v=beta&t=SHPMw3wcfx8lEYEezR0vhefEH4juO2Lq5ddSlAznPrs",
        "likes": "72",
        "commentsCount": "7 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-11-01 13:00:09",
        "content": "Back in December 2022, we got our first Generative AI client, not strategically, but accidentally, and that proved to be a blessing for us!\n\n\nOur team at that time was not heavily skilled in core AI/ML, so if any AI/ML client reached out to us, we were either saying no to them or just getting help from our partners or contractors.\n\n\nSo when this client came, I reached out to one of our contractors, who's also a close friend of mine, to help us out with it. We had a meeting with the client and everything went well. The client agreed to continue with us. I had a discussion about it with the team and we figured we don't really need a custom AI/ML solution for it. We could just use's APIs. At that time, ChatGPT's official API was not out, so we just used DaVinci model of the Text Completion AI.\n\n\nNow that client was super passionate about his product as well. He didn't just hire us to let us work on it, sit back and relax. He was actively making content on his socials to spread awareness about his product, sharing the whole journey of development. When we showed him some initial results, he made a video on his socials, screaming with happiness \"THEY DID IT!!! 🎉\" We were happy, of course, but now the stakes were even higher, because if we messed up, he'd sure as hell announce that in a video.\n\n\nTurns out, the project was delivered on time, everything went much better than expected, and because of the marketing the client was doing already, he got a good number of paying customers within the first month of launch. It was an amazing success.\n\n\n's API was launched much later, and when it did, we replaced the Text Completion with ChatGPT's API and everything kept working as it should.\n\n\nThat proved huge for us. We used that success in our portfolio. Then the Gen AI craze started and the market got saturated with a bunch of startups and products based on Gen AI. Every client we talked to, got impressed with our portfolio and awarded their project to us. We kept delivering successful projects and kept adding to the list of successful Gen AI projects.\n\n\nWe did not make any strategic plans to hop on the Gen AI hype, but somehow, coincidentally, we did, and that proved huge for us.",
        "date": "7mo • \n ",
        "image": "",
        "likes": "40",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-31 12:45:01",
        "content": "Smile, be more approachable, and avoid using negative words!\n\nI was once talking to a client, and after around 10 minutes of discussion, he said:\n\n\"I like talking to you, you have this nice smile on your face\"\n\nYes, I keep the cameras ON while talking to new clients. It builds credibility and they get all kinds of positive gestures through your facial expressions.\n\nWhenever you are talking to a potential client or any new prospect, they have all these concerns in their mind, whether or not you can deliver, whether you are a good communicator or not, or if you have what it takes to do what they want.\n\nIf you really wanna build a strong relationship, you have to make sure that the other side feels comfortable talking to you and raising their concerns.\n\nOur team is trained to avoid using negative phrases or negative terms at every cost. So instead of saying:\n\n\n\"No, we don't agree with this approach\"\n\nWe say:\n\n\"Hmm.. that's good, however, what if we do it like....\"\n\n\nNotice the difference? You communicated your approach without even denying theirs.\n\nPeople don't like to hear no for an answer. Especially if they are paying you. It depends on you how to reach the end goal successfully, by keeping all stakeholders happy and making them feel they are part of the decision-making process.",
        "date": "7mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFPnI8nc3bg9Q/feedshare-shrink_800/0/1698751902114?e=1722470400&v=beta&t=_13yr2x8Z8xz8CWdMHXFiIoUZcjPuGcsmxq8ZAMdvAA",
        "likes": "44",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-30 12:46:36",
        "content": "A good sleep solves everything 😴\n\nHappened to me countless times. I figured this “like hack” out pretty early in my career, that the solution to a lot of problems can be a good sleep.\n\n\n👉 Tensed about a project? Couldn’t figure it out? Slept. I woke up and the problem that seemed hard just solved itself.\n\n👉 A client was asking for too much additional work, driving me crazy, and I was just about to lose it. I just slept, hoping I’d wake up with a better solution. And I did. Talked to the client and found common ground.\n\n👉 Something not going right in the office? Just went home and without overthinking, I slept. And when I woke up, I could see the situation wasn’t as bad as my mind was showing it to me.\n\n\nEveryone burns out. You can push yourself to a certain limit only, after that, your brain efficiency declines and you start to panic over very simple and small problems. Sleep is like a debugger for your brain and can help you out with problem-solving and creativity.\n\nHope this post motivates someone enough to get a good 8-9 hours of sleep tonight :)",
        "date": "7mo • Edited • \n ",
        "image": "",
        "likes": "63",
        "commentsCount": "5 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-27 13:07:37",
        "content": "You ask anyone, \"How important is personal branding?\" and they'll say \"A LOT!!\"\n\nAnd then you ask, \"Are you doing it?\", and they'll be like \"🤐\"\n\n\nI have been making these excuses to myself for many years,\n\n\"I don't have time\" (A LIE!)\n\"It'll look cringe\" (To the ones who are not even my target audience)\n\"I won't be able to continue\" (You first need to start, and then you can worry about continuing)\n\"I'll run out of content\" (Just START!!!)\n\n\nMany people were telling me to start writing content, and even some of my team members, whom I was trying to motivate for personal branding, were like:\n\n\n\"Hashir Bhai aap to start krain, aapky pas to itna kuch hy btany k liye\"\n(English) \"Hashir, you should start, you have so much content\"\n\n\nAnd then I started reading this book named \"Little Red Book of Selling\" byand there was this line:\n\n\n\"It's not about who you know, it's about who knows YOU\"\n\n\nAnd it clicked 🫰 You can be the best one out there, you might know so much more than others, you might have the perfect solution for someone, but if people never know you, you don't exist.\n\n\nI mean, it's hard to stay consistent. You start to lose motivation. But the key is to keep doing it consistently, especially when you don't even feel motivated. It's been more than a month now, posting content consistently, one post per day.\n\n\nI've connected with so many people, learned so many new things from people who reached out to me just by reading my posts, and I am glad I started. I hope anyone who is planning to start and reads this post can get that final kick of motivation and start today.",
        "date": "7mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFI8NdOhwforQ/feedshare-shrink_800/0/1698409111628?e=1722470400&v=beta&t=rxsQH_N5WVgvfvMtKdnN9NjnV1wBUfTGLXyDaBJd25E",
        "likes": "49",
        "commentsCount": "5 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-26 12:48:17",
        "content": "I am a developer by heart. I never learned about running a business, building a sales team or talking to clients. I got into development \"by passion\" and not \"by chance\" and I still am super passionate about it. I still watch most of the tech conferences, Google I/O and everything.\n\nBut I think now is my time to learn about sales and business. I won't say everything I do is through my own thoughts and my own ideas. I watch a bunch of business podcasts, following podcasts ofandfor a long time.\n\nI have been watching what other companies are doing, trying to learn from them and defining my own \"Dos and Don'ts\".\n\nI am not much of a book reader but I am trying to force this habit onto myself and trying to learn what I don't know, through these books. Yesterday on my flight back to Pakistan, I started readingby, trying to learn how to build a predictable sales pipeline. This book was suggested by, CEO of, when he was on Thought Behind Things.\n\nI recently completed Little Red Book of Selling by, and I was blown away by all the principles of sales I learned from it. Currently trying to apply them as well.\n\nBest of luck to everyone who's trying to learn something new everyday (and to myself as well)",
        "date": "7mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFz1df315b1yQ/feedshare-shrink_800/0/1698324495772?e=1722470400&v=beta&t=gzuy-3fIPjz5WtiiqYcNr1qSbflUIZCkIvrK0JNf1oI",
        "likes": "111",
        "commentsCount": "7 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-25 13:45:00",
        "content": "Consider myself fortunate enough to be in Dubai 🇦🇪 at just in right to time to attend this event again. \n\nGot to meetand listen to her fantastic session on sustainability & smart cities.\n\nGlad to have metand listened to his thoughts and ideas about using LinkedIn optimally to promote your business.\n\nAlso got to meetfrom,from Digital Essence,from,from, Sachin L S from,,fromand many more people.\n\nAnd once again, thanks to&for arranging such an amazing event, as always.",
        "date": "8mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQEn96JotvobbA/feedshare-shrink_800/0/1697402854245?e=1722470400&v=beta&t=h2fOKKNG8g5YaxWo-YxnesD9ifuauNMabs0DxZodyHY",
        "likes": "36",
        "commentsCount": "8 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-24 12:30:01",
        "content": "“We don't want someone who's driven by money” Bro everyone is driven by money. You are running a business? You are driven by money, the most! Cut the crap!\n\n\n“But we are a startup, aiming to raise some funding” So if I understand it correctly, you want to make money without spending money. Right?\n\n\n“But our business will change the world and people’s lives” You are not willing to make this one person’s life better. You can worry about the world later.\n\n\n“We want to hire someone who works towards the company’s success, not just for money” It’s your company. You need to work towards its success. And part of the job is to hire good people, and that costs money.\n\n\nThese statements can be heard from recruiters and clients alike. I’ve just given you answers to all of them.\n\n\nWhenever someone says “we are not looking for someone who’s driven by money” and still asks you to work for them, be alarmed that the person is trying to manipulate you.\n\n\nEveryone has personal ambitions, situations, and life goals, you can’t expect people to work for your ambition, by being as ambitious as yourself. But if you really want to make them ambitious about your ambition, make sure they are rewarded for it, and can clearly see how the fulfillment of your ambition will make them successful as well.",
        "date": "8mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4E22AQExdJMXfYEfAg/feedshare-shrink_800/0/1698096896505?e=1722470400&v=beta&t=-PtEhe9Hpb7HoiVNzQCHlEYHkZEDDnMqZsNwetpWbdg",
        "likes": "53",
        "commentsCount": "3 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-23 13:00:10",
        "content": "You can be transparent & honest about your processes and can still survive and thrive in a business.\n\nIn the early days, a lot of the clients said “No” because of our transparency, because they needed to work with someone having “relevant portfolio” or someone with “years of experience” in the industry. Go ask our clients, I am making this statement publicly, on my public profile:\n\n- we never claimed to have years of experience\n- we never claimed to have huge teams\n- we never claimed to be based in the US or Europe\n- we never claimed to have engineers with 6+ years of experience\n- we never faked being an individual and secretly running a company behind the scenes\n- we never shadow our team members, clients always know who’s working on the project\n\nWhenever some client was persistent on working with someone with more experience, we had to let go of them and tell them exactly about the team and experience we have. We promise the quality of work. We promised our dedication to deliver their project. We might be late on a deadline, but we’ll be transparent about what’s happening in the project.\n\nWe might not be the best ones out there, but we damn sure wanna be the honest one.\n\nClients lack trust in working with agencies, because of the shady practices used by them. We are willing to limit our growth if that’s the cost of being honest and transparent. But if you genuinely ask me about it, I don’t think our growth has been slower. We have been able to grow to a team of 28 people in the short time span of 2 years, Alhamdulillah, and it’s crazy enough for me.",
        "date": "8mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFqyKnc_qE_dQ/feedshare-shrink_2048_1536/0/1698007918587?e=1722470400&v=beta&t=O9RY5AdVor3FbpC0j7U0g3PEbrZSDm8HNz1P1XLQGk8",
        "likes": "70",
        "commentsCount": "4 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-20 14:24:12",
        "content": "A couple years ago, I saw an interview of someone who said \"You should make a list of your life goals\". I wrote a goal that day to attend \"CES\" the consumer electric show. Nothing else was added to that list after that because I forgot about the list, and that goal really seemed very far fetched.\n\nFast forward to 16th of October, I stepped into Gitex. A massive tech event, happening in. Not CES, but it was everything I imagined a huge tech event could be. Flying car prototypes, super cars, holograms, VR, tech conferences, you name it.\n\nSurrounded with some of the most exceptional minds of this fast moving industry, getting to know the people who have done wonders in Smart Cities, Digital Twins, AI and Holograms, it was a humbling experience. Hope to attend more of these in the future.",
        "date": "8mo • \n ",
        "image": "",
        "likes": "46",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-19 14:05:59",
        "content": "I go to these events and meetups alone. I do not bring friends or anyone with me, because that helps, or should I say, forces me to try and meet new people, make genuine conversation with someone new, try to spend more time with them, instead of running to the next thing.\n\nA good ice breaker can be something as simple as:\n\n\"Hey, can you take a picture of mine, please?\"\n\nPeople love to help others, it makes them feel they are important and can make someone else's day. So any conversation you do after asking a favor, won't be some robotic sales pitch that you or the other side have crammed.\n\nTalking to new people comes with all sort of awkwardness, but that awkwardness lasts just 5 seconds, and then you are into a conversation.\n\nI will be at Gitex tomorrow as well, and then I will stay in dubai till 25th. Happy to meet anyone who's here and wanna have a chat.",
        "date": "8mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQEa0OFiO0zltA/feedshare-shrink_800/0/1697724357462?e=1722470400&v=beta&t=0LeMsalCPzz2q3d21jy6KcninwDtiV8gmvoNGo-69Eg",
        "likes": "125",
        "commentsCount": "3 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-18 13:20:41",
        "content": "\"You can't connect the dots looking forward; you can only connect them looking backwards. So you have to trust that the dots will somehow connect in your future. You have to trust in something - your gut, destiny, life, karma, whatever.\" - Steve Jobs\n\nNow that I look backwards, I can see that.... the dots.... have connected.... just fine!",
        "date": "8mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4E22AQEQD3OdFg859Q/feedshare-shrink_800/0/1697635239530?e=1722470400&v=beta&t=TBUNoDX05CzKSikcQEKZzHez7nFWifTlzyB2kfB25Js",
        "likes": "49",
        "commentsCount": "3 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-17 14:30:35",
        "content": "Do not. Sell anyone. Anything. On Gitex.\n\nPeople are here to represent themselves, what they've accomplished over the years, what they've built, how they are helping their community, the industry and the ecosystem as a whole.\n\nIf you go around, handing out your business cards to everyone you meet, you can assure yourself that the card is going into a bin that night.\n\nHow to build a meaningful relation? Listen to what they have to say. Ask meaningful questions, go deeper into what they are representing and how the've come so far. And then you will (probably) hear the other side saying:\n\n\"Hey, tell me about you? What do you do?\"\n\nAnd that's when you tell them what you do. If they find value in it, they'll ask to get connected, and you won't even need a business card to build that relation. You just need to listen what they have to say.\n\nThis is my strategy in every networking event I go to, and it seems to be working out.\n\n\n\n\n\n---------------------------------------------\n\nI am posting my journey of building, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "8mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQHg5z9DsVLI6A/feedshare-shrink_800/0/1697553002900?e=1722470400&v=beta&t=OF0R425RO5dBeJnmvRmnvp6scviZxVZbo_3Nc2qc0LM",
        "likes": "153",
        "commentsCount": "4 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-16 15:01:57",
        "content": "Meet us at GITEX GLOBAL Largest Tech & Startup Show in the World!\n\nWe are at World Trade Center, Dubai 🇦🇪, meeting up with collaborators, partners and customers, trying to understand where the world is headed in terms of technology and how we can take part in the ongoing development and growth of it.\n\nJust drop us a comment or reach out to us if you wanna meet us at Gitex.",
        "date": "8mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4E03AQF5iOwHjAfBGg/profile-displayphoto-shrink_100_100/0/1678167415920?e=1724889600&v=beta&t=LapSxPdtX2ZAlf59-Avnshuo15pmML6kptdZglKTX8o",
        "likes": "20",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-16 11:42:59",
        "content": "First day at GITEX GLOBAL Largest Tech & Startup Show in the World and it's jam packed with almost everything and anything you need. \n\nGot to meet some very good people, got to see some surprisingly amazing technologies and truly looking forward to expore more in days to come.\n\nI am here in Dubai, attending all these events. So if anyone wants to meet, just drop me a message on LinkedIn and we can meet for sure.",
        "date": "8mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQHGq2R_dvTh2g/feedshare-shrink_800/0/1697456574777?e=1722470400&v=beta&t=ucWu-98tk7J7DWV9A-MzvITxF0BEFj0oVPUwzCfSiCE",
        "likes": "87",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-15 11:32:43",
        "content": "I am so overwhelmed right now. Saw him at a booth at Expand North Star by GITEX GLOBAL Largest Tech & Startup Show in the World and I was just clueless what to do. Went up to him, shook hands, and we talked for like half an hour.\n\nHave been followingfor a long time and a lot of what I do is what I Iearned through his podcasts. I asked him all the questions I had while I used to watch his podcasts and he basically answered all of them, and made my mind absolutely clear about where we are headed and what we should do as a country and what I should do as someone who runs a small operation of 28 brilliant people.\n\n\n\n---------------------------------------------\n\nI am posting my journey of building, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "8mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQHE8-G_0wqoaA/feedshare-shrink_800/0/1697369562884?e=1722470400&v=beta&t=EqHa8Lz-yKDw8iPJLMH1LQoS262803jywtXQ-RSulF0",
        "likes": "178",
        "commentsCount": "7 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-13 13:25:57",
        "content": "No amount of marketing, solves a bad product! \n \nI heard this in a Gary Vaynerchuk video a long time ago and it got stuck with me. You can have the perfect logo, a video that catches your audience's attention right away, a PR strategy that shapes the narrative of the audience for your product, exactly as you want, but at the end of day, when your prospect converts to a customer and the product or the service doesn't deliver what was promised, they'll go away, very frustrated with your reputation shattered.\n\n\nIn the journey of any startup or any product, you are always inclined towards doing the “cool” stuff, because everyone else is doing it. You wanna have a podcast to represent your product, a team building nice videos with prototype of your app, a sales team going on events and posting pictures with high profile clients, and while focusing on all of this, you fail to focus on the most important thing, the product itself.\n\n\nIn the initial days of any startup, you really need to focus on:\n\n\n🛠 Building the product in the right away\n\n🤝 Focusing on the customer’s pain points\n\n📈 Targeting small achievable goals\n\n😇 Do not market what you are not going to ship\n\n🙌🏼 Saving yourself from the peer pressure of doing the cool things\n\n\nDo this, build a good product, and then you can go as crazy on the marketing as you want to.\n\n\n\n\n---------------------------------------------\n\nI am posting my journey of building, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "8mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQG9Fr7gLS-JfQ/feedshare-shrink_800/0/1697203556207?e=1722470400&v=beta&t=RlKxapAtqfyWLEnurCOLPjXW1pVWhy-Ekn5LfZZrlg8",
        "likes": "50",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-12 14:08:12",
        "content": "Your clients can sell your product or service better than you! They are living, walking testimonials!\n\n\nIt's a double edged sword. It can do wonders or it can just backfire badly. The only way to get it right is\n\n\n⚡️ If you deliver the highest quality of work\n\n😇 You remain honest with your client\n\n💎 You keep your processes and the progress transparent\n\n🤝 You give them what they came for, a good, reliable - partner\n\n\nTwo of our clients who didn't know about each other, met each other at a conference and started discussing their products. Somehow they ended up discussing how they were using a team from Pakistan, they mentionedand how they were super satisfied with the work we've done for them. One of those clients pinged and told me this story, like \"Hey, I met that other client of yours at an event today\"\n\n\nLike, what are the odds? Two of your clients, somewhere far away in the world, meeting and discussing about your work. Absolutely amazing! We are still working with both of them, developing their SaaS apps, and maintaining the relationship.\n\n\nHad we not maintained a good relationship with them, we'd end up losing both of those clients that day. You start seeing the results of these things in the longer run. You might not be seeing the results right away, but as you continue to deliver what you promise, keep the client at ease, you'll end up building a reputation for reliability, and I am glad we have built and maintained that sort of relationship with all of our clients.",
        "date": "8mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQEs9HpllH-Xog/feedshare-shrink_800/0/1697119690201?e=1722470400&v=beta&t=5TsvhXbNolPFUJUPAgtB-IXuuPn18xzMRQ-I1YPwdDY",
        "likes": "50",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-11 13:00:01",
        "content": "Everyone's formula for success is different. Don't get discouraged by seeing someone else's journey or path different than yours. What works for them, might not work for you.\n\n🏃🏻‍♂️ For some, waking up early and going for a run, can be an energy boost, while someone can get crazy things done after midnight, alone, on their laptop.\n\n👨🏻‍🏫 For some, getting mentors to guide on each step of the way is helpful, while someone might not be able to think straight with someone spoon-feeding.\n\n🏤 Someone might be able to build a team in 2 weeks, while you are struggling for 4 months and still have just 2 team members. In the long term, 2 weeks or 4 months is a very insignificant amount of time. Ultimately, you'll make it.\n\nIt's not about following any particular formulae, it's about consistency. You keep trying until it works.\n\n\n\n---------------------------------------------\n\nI am posting my journey of building, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "8mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFZKB_0WnKGwA/feedshare-shrink_800/0/1697022879347?e=1722470400&v=beta&t=tnzTTLLLMENihhQznS9fWa0w32fGZ_MOYvKvk9HOhQs",
        "likes": "54",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-10 12:29:46",
        "content": "Landed in Dubai on Saturday last week, currently on a spree to attend as many conferences and events as possible, to meet potential collaborators, partners and possibly future customers. \n\nGot the chance to attendandtoday at.\n\nGot the chance to pick the brains of,,\n,from,from, Hadi H. from, Anurag D. fromand many more people.\n\nHoping to attend more of these events in the days to come. If you are in dubai and wanna meet for a chit chat, drop me a message and we can sync up a time.\n\n\n\n---------------------------------------------\n\nI am posting my journey of building, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "8mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQEk9fjubAIrdQ/feedshare-shrink_800/0/1696940892334?e=1722470400&v=beta&t=kvX178uwt4d976_3OQ0bZIAaia3vdAgi2vZAkfV1hsg",
        "likes": "78",
        "commentsCount": "3 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-09 14:00:07",
        "content": "I should charge less if I am starting out, right? 🤔 No! ❌\n\nDefining the base rules, lower limits, and sticking to them is very critical when you are starting a client servicing business. Everyone starting out thinks if they charge lower for their services, they might be able to secure some initial clients. I wouldn’t agree.\n\nClients, the good ones, go for quality. Never for price. See what your industry is already charging and charge the same rate.\n\n\n💪 Compete on quality, commitment, support, reliability.\n\n💸 Do not compete on price. There’s always someone willing to sell for lower than you.\n\n\nWhenstarted, we had a minimum-maximum range and started saying no to clients in the very early days who were not paying us at least our minimum. Initially, it’s hard to say no when you are starting out. You might close 1 client with your “good price” rather than closing 5 clients with your “lower price”. But it ensures the quality of clients you are adding to your pool. And the pool, eventually, will keep growing.\n\nIt’s so hard to up-charge a client who is used to paying you a low price. Not impossible, but pretty hard to convince why you are asking him $10000 for a product when you previously built a similar one for him for $2000. You will never get out of this loop.\n\nBut that being said, I’d totally admit that my situation was different and I was privileged. I had a backup for multiple months that I had saved for the past couple of years with jobs and freelancing. So it was easier for me to say no.\n\nSo my recommendation would be to:\n💵 Build a financial backup first\n⚡️ Charge high, so you can pay well to maintain a quality engineering team\n✨ Build a reputation for quality & reliability\n🤝 Make sure your clients feel you’ve “Got their back”\n\nStrong financial backing is crucial to build a sustainable business because not every month is equally profitable. And it’s your responsibility, as the business owner, to think months ahead, instead of days.\n\n\n\n----------------------------------------------------------------------\n\nI am posting the journey of building RipeSeed, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "8mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFNixLoNQgPbg/feedshare-shrink_800/0/1696847357492?e=1722470400&v=beta&t=3v3sjyzgHpIK2XsndnEWhZOEC4QJO1-5e8F8pndORbs",
        "likes": "62",
        "commentsCount": "11 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-07 07:43:02",
        "content": "See you all at AWS UAE Community meetup on October 21st 🕓",
        "date": "8mo • \n ",
        "image": "https://media.licdn.com/dms/image/C4D03AQHBmu8IY45zVQ/profile-displayphoto-shrink_100_100/0/1657398937676?e=1724889600&v=beta&t=sha2iqE5Aso4gIPXg0BL8pS2y2PRO8M7Mz42WGc_IKI",
        "likes": "16",
        "commentsCount": "",
        "sharedBy": "Hameedullah Khan",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:7116322557812744192/"
    },
    {
        "postTime": "2023-10-06 13:30:06",
        "content": "There’s a huge difference between “I’ll do it” and “I’ll do it tomorrow at 5:30 PM”\n\n“Work expands, to the time, allowed for it” - Parkinson’s Law\n\nThis is a universal truth. You give me one week to write a post, I’ll finish writing that at the last minute. You give me 1 hour, you’ll have the post ready in 50 minutes. I heard about this law first time in avideo () and since then, I started applying that everywhere.\n\nI noticed sometimes at, we were planning a lot of stuff, but not everything was seeing the light of the day. I found out that we were not “time-bounding” everything. We might be discussing a lot of stuff, aiming to build a social media strategy and post good content, and tech-reels, but we were not adding a deadline to “when we need to do it?”\n\nEarlier last month, I started focusing on that and saw great and instant results.\n\nStarting with myself, I gave myself the goal of writing one post per day. No matter how good or bad. Just one post. It’ll be just me talking about me and what we do as a company. Just have to put them in words. And it started happening. Between 3 to 5 PM every day, my focus is to write a post that I have to publish by 6 or 7 PM. And you can see the consistency.\n\nThen we started focusing on re-shaping ourLinkedIn strategy, thanks to the suggestions from. We started to set a timeframe to create certain kinds of content. We defined a time on a particular day in every week when we shoot the reel, and then we edit and finalize them. We created a backlog of almost a whole month just by following this approach.\n\nSomeone from my team said, I had asked that person to provide me something, but I haven’t received anything from them. And I asked, “well, did you ask them to deliver that thing to you in 1 hour or any deadline at all?” And the answer was “Umm… No??” So I sat with them, sent the message with an exact time we needed the deliverable, and guess what? We received it 5 minutes earlier.\n\nThis is one of the biggest life hacks I have recently discovered. Start time-bounding everything. From the smallest to the biggest goals, if you don’t have time allocated to them, they won’t happen.\n\n\n\n----------------------------------------------------------------------\n\nI am posting the journey of building RipeSeed, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "8mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQE7ZujSa5EzmA/feedshare-shrink_800/0/1696595330158?e=1722470400&v=beta&t=SFMZjgRH364dTj7ir9WEzSClR6-O3bIaBF9-oDbDGkc",
        "likes": "51",
        "commentsCount": "3 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-05 12:30:02",
        "content": "The REAL sale starts after the deal is signed ✍🏻\n\nMost of us think of it the other way around. Signing a deal with the client is not the actual win. That’s just the start of a new relationship, and the real sales work starts after that.\n\nAfter the deal is signed, the client entrusts you with his reputation, his decision to work with you, and your capabilities to deliver what he wants in a well-defined time. If you can prove to him that his decision to work with you is right, you can turn them into a fan from just a client.\n\n\n🎯 Make sure your client’s business goal is being met, with what you are doing for them\n\n💼  Your client might be asking for something, not knowing the costs associated with it. Being a solutions provider, it’s your job to tell them about any effects of those changes before you implement them. Your client will thank you for that.\n\n🕵🏻‍♂️ Being a technical solutions provider, it’s your job to suggest features and potential edge cases that your clients might not be even aware of, that are critical for their use-case\n\n\nAt, every person involved in delivering the solution is trained to keep the client’s success in mind while working on the technical solutions. We have faced this situation countless times where the client’s proposed solution wasn’t aligned with their business goal and a little discussion and briefing from our side helped them visualize the final results more clearly.\n\nIn a later post, I'll share some examples of how we helped some clients of ours reach their business goals and the kind of appreciation we received from them 🌟\n\nTill then, best of luck!\n\n\n\n----------------------------------------------------------------------\n\nI am posting the journey of building RipeSeed, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "8mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQHBWkMaTLR9HA/feedshare-shrink_800/0/1696501274281?e=1722470400&v=beta&t=XzQqZ2DQP9RMms_SVQnAdoeABORag8ymAoMfQQwCvU4",
        "likes": "75",
        "commentsCount": "6 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-03 12:45:00",
        "content": "I did not choose to be an introvert, but I can choose to be an extrovert, or at-least try to be one, if that’s the need of the business.\n\nEveryone who knows me can validate the fact that I am not much of a talker. But now that I have to represent RipeSeed, do I want to use this as an excuse for not networking with people, building connections and improving myself? Nope. No chance.\n\nKeeping this in mind, I aimed to visit Dubai in mid-August, with zero experience of networking whatsoever.\n\nBefore my visit, I found a networking event happening atin Lahore. So I thought, let’s just visit as a rehearsal of how I am going to represent the company in Dubai. It went well, and to my surprise, even at that event, I found someone who showed interest in potential collaboration, because a client of his, needed engineering resources. That was a good confidence boost.\n\nThen fast-forward a week, I reached Dubai, and the day I landed, at 4 AM in the morning, I had two meetings lined up for the same day, arranged byand. I showed up, met some very nice people, and made some good friends as well. And this unlocked that challenge that seemed so hard in the beginning. In the days that followed, I was attending 1 to 2 meetings per day, every day, and that visit proved much more beneficial to me than I could ever imagine.\n\nIt seemed so hard in my mind. But being there, representing the thing I have built, knowing that what I am representing stands for the quality that we are proud of, it was not so hard after all.\n\nAnd now, I am visiting again in next week, hoping to make the most out of it.\nWill be sharing the progress and how it goes in the weeks to come.\n\n\n\n----------------------------------------------------------------------\n\nI am posting the journey of building, the challenges I have faced, and how I solved them, here on, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "8mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQGolvksxizY2A/feedshare-shrink_800/0/1696326864405?e=1722470400&v=beta&t=JeTCO9MQ1TqMxQxLEVNEee1rUWc2kuGGTxuKhfKF0Cw",
        "likes": "112",
        "commentsCount": "8 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-10-02 13:00:03",
        "content": "“So I’ll just hire three people, I know I have the backup to run this small operation for more than 3-4 months, and I am willing to lose this amount if it doesn’t work out, the STAKES are not THAT HIGH”\n\nI said this to myself when I started. And almost all the decisions I ever took were with the same approach.\n\n”I’ll try it out, and if it doesn’t work, I’ll try something else, and if that doesn’t work, I’ll try….” you got the point.\n\nAnd now the experiment that started with those 3 people, has grown to a team of 28 people. And now the stakes are pretty damn HIGH!\n\nI didn’t start with any processes, any departments, any team. These things happen with the time. Problems always solve themselves. It’s up to you whether they are solved in a good, scalable manner, or just as a workaround.\n\n\n\n----------------------------------------------------------------------\n\nI am posting the journey of building RipeSeed, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "8mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQEwODWto-gKHw/feedshare-shrink_800/0/1696240178048?e=1722470400&v=beta&t=-4QPUaLl2fggGJDRybenxuj0StCZaAGbWn6hmCQF-XE",
        "likes": "157",
        "commentsCount": "14 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-09-29 12:38:04",
        "content": "\"....then they MAY buy from you\"\n\nRead this in \"Little Red Book of Selling\" by Jeffrey Gitomer. An absolute Gem of a book. I have been trying to buy this book for a long time but couldn't find it anywhere. Then on my recent trip to Dubai, found and bought this at.\n\nI am not much of a reader by habit, but trying really hard to make this a habit of mine. This book is filled with value and I'll be posting some gems from this book every now and then.\n\nThis quote and the illustration emphasis on the fact that you have to provide the value first, create a trust based relationship first, be more empathetic towards your prospect first, and only then, you can expect something in return.\n\n\n\n----------------------------------------------------------------------\n\nI am posting the journey of building RipeSeed, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "8mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFzEQ1wE3LUIQ/feedshare-shrink_800/0/1695991082227?e=1722470400&v=beta&t=OJgNB-wvlgyodsxnf6imXTo0ovrNTKOBPwZNF3DGvTo",
        "likes": "22",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-09-29 08:30:30",
        "content": "Absolute Gem 💎 Opportunities are everywhere.",
        "date": "8mo • \n ",
        "image": "https://media.licdn.com/dms/image/C4D03AQGwRB_po7hdOw/profile-displayphoto-shrink_100_100/0/1516570872533?e=1724889600&v=beta&t=3W7wUb50oOUQhYLd5qX-w4r10lcojWS0JC1tO_1OnqE",
        "likes": "11",
        "commentsCount": "",
        "sharedBy": "Subhash Choudhary ..",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:7113403541876051968/"
    },
    {
        "postTime": "2023-09-28 12:00:01",
        "content": "You don’t want to win the deal 🙅 you want to win the heart 💖\n\nI cannot emphasize this enough, trust and relationship comes first. The deal comes at the very last. Whenever you are interacting with a new prospect, consider yourself in their shoes.\n\nA good client will always do his due diligence. He is talking to 10 more people other than you, finding someone he can trust with his money or if he is representing his company, he is even more cautious. His organization has entrusted him to choose a provider and your performance (good or bad) will be considered his performance. So his reputation is at stake, which is worth way more than money 💸\n\nIn one of the videos from, I heard him saying something like:\n\n”Be on the same side as the client. You don’t want to be on the opposite side of him and fight with him. You want to be on the same side as him, and have the problem on the other side, and then help him solve that problem”\n\nOnly if I could find that video again, he explained that so much better. But this advice really changed my perspective. Whenever I go to calls with new prospects, I go with the aim of solving their problem, the deal will follow if we are actually good at it (and it mostly follows)\n\n\nHere are a few things I do to change the ton of any meeting and make it favorable for the prospect:\n\n🎥 Turn on the VIDEO. Show them your face. Show them you are a real human being, not someone shadowing someone else, hiding behind a screen.\n\n😬 SMILE. It changes the whole tone of the meeting. Your prospect will be at ease and will be comfortable right away. It also shows you are confident in what you are talking about.\n\n💰 Don’t sell your offerings at every word they say. Try and solve their problem. If they trust your word, they’ll ask how you can help them.\n\nAnd the hardest one.\n\n😇 Learn to say no to things you can’t do. Tell them if you are not the right fit. Wish them luck. They’ll be back with something in the future. The last thing you want is to pick up something you can’t do and embarrass yourself in front of your client.\n\n\nYou start aiming for the hearts of your prospects and they’ll start converting into your clients with deals 🤝\n\n\n\n----------------------------------------------------------------------\n\nI am posting the journey of building RipeSeed, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "8mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFtPez7O87r0A/feedshare-shrink_800/0/1695895619666?e=1722470400&v=beta&t=ncTt4WrEg_1cU4O9p5K5gF32oHR9vuoJZY5H5slnQ5U",
        "likes": "44",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-09-27 12:09:13",
        "content": "Not many people know this, but before starting RipeSeed, I started a company named SkillOverDev (yup, that was the name)\n\nI started this while I was doing a job. It was like, if it works, great, if not, what’s the loss? Not much.\n\nThere are a bunch of small mistakes I made that resulted in closing that small operation within a month.\n\n\n1. I kept that company remote only. I hired a person from LinkedIn, good guy, and we started working on a project. It was really tough for me to manage. I was doing the job, plus this side-hustle, and I wasn’t able to create an environment that could inspire anyone.\n\n2. I wasn’t afraid of the results. I didn’t burn my ships and I was always looking at that backup plan all the time if things went south.\n\n3. I wasn’t focused enough. I had more than 70% of my time dedicated elsewhere.\n\n4. I wasn’t invested myself. I was just trying to get the work done through my team and wasn’t invested in the company formation myself.\n\n\nHardly a month passed and both of my initial hires left for better opportunities. And guess what, I wasn’t very sad about it, which is very alarming ❗️\n\nI learnt some lessons that helped me later on when I started.\n\n\n1. I kept myself 100% invested in RipeSeed and nothing else. No side-hustle, no hobby projects, no part-time job, I was doing everything for RipeSeed 🤝\n\n2. I didn’t rely on remote. It’s really hard to form a good culture being a remote company in the early days 💻\n\n3. In the first year or so, I was directly engaged with the team to deliver the projects, but later on, when the team scaled, I started moving into managing things, investing more in team formations, building sales process, and now marketing and branding 🚀\n\n\nAnd..... seems like..... it worked 👀\n\nSharing this little failure story of mine to help anyone planning to take the leap!\n\n\n\n----------------------------------------------------------------------\n\nI am posting the journey of building RipeSeed, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "8mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQEpS4bRs4OuYA/feedshare-shrink_800/0/1695816552736?e=1722470400&v=beta&t=xXbGC6UZ3KGGi2myy-iolDHfxlc4OR0muobZwkSzKgs",
        "likes": "160",
        "commentsCount": "5 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-09-26 13:37:24",
        "content": "Showing up is half the battle!\n\nDon't feel like working today? Don't work, just show up.\n\nTired of writing posts on your socials without results? Just post one more (and repeat this every day)\n\nNot sure if this new company you are interviewing for is worth it? Just show up to the interview and you'll figure it out.\n\nThink this networking event in a place far away from your residence might not be worth it? Just show up anyway.\n\nNot sure if that certification would be worth it? No harm in doing that anyway.\n\nThere are these small things in life that we need to just keep doing even if we are not able to see the results in the short term.\n\nThe dots connect, always, every time, in the future.\n\nIt has proven right for me time and time again.\n\n- A company I was underestimating ended up being the one I worked for.\n- I have found potentially good leads from networking events that I was highly underestimating.\n- Some person I met and I thought wouldn't be of any help, ended up being a good friend.\n- A client that I thought was just going to waste my time, ended up being a crucial client for the survival of our company for a couple of months\n\nNever underestimate the random things happening in your life. That's the specialty of the unknown. It might turn into something huge, otherwise, what worse can happen? Nothing? Same as before? Good. You move on to the next random thing.\n\n\n\n----------------------------------------------------------------------\n\nI am posting the journey of building RipeSeed, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "8mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQHO-qjYKaIVzA/feedshare-shrink_800/0/1695735443091?e=1722470400&v=beta&t=Lb9mBvkheHmDZfDSmzwW0B5CfErq8XzfF6Z_hnuIfjo",
        "likes": "61",
        "commentsCount": "8 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-09-25 13:12:39",
        "content": "A jack of ALL Trade 👷🏻‍♂️ and master of SOME 💪 (not none)\n\nIt’s time we get rid of old proverbs and adapt to some new ones. We heard this thing a lot that you need to find a specific niche, you have to be specialized in one particular skill set and master that ONE skill ONLY.\n\nIt never made sense to me. I always wanted to be a problem solver, instead of a Frontend Developer, Backend Developer, App Developer or Cloud Architect. Since the time I started working professionally, I never confined myself to any one particular technology. I wanted to learn to build apps, websites, deploy infrastructure, build CI/CD pipelines and anything that could fall in the bracket of “tech”. Because I loved “tech”.\n\nThis has helped me a ton while I was working in companies. I always used to find the best solution to any problem, instead of trying to fix every problem with the only skill that I know.\n\nThis helped me when I started freelancing, because I could do everything, or even if I couldn’t do everything, I knew what the right solution is.\n\nAnd this helped me when I started, as I gave the clients the confidence that I knew the problem to their solution. I am not here to sell them a specific tech stack. I am here to help them find the best solution, even if that doesn’t fall under the category of skills I have.\n\nI always advise the same to my team and everyone basically. Be a problem solver, the world already has a bit too many React developers.\n\n\n\n----------------------------------------------------------------------\n\nI am posting the journey of building RipeSeed, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "9mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQEjuQthkX0L-w/feedshare-shrink_800/0/1695647558137?e=1722470400&v=beta&t=tDzXnsvCHxxiZ1JFCD-kC5F7i36fYmm2Gvt5cJ5G8xs",
        "likes": "135",
        "commentsCount": "15 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-09-22 14:52:11",
        "content": "An experience that’s so close to my heart ❤️\n\nBack in May 2022, a couple of students reached out, asking to deliver a seminar on the topic of how to start a business through freelancing. I had 0 experience in public speaking, let alone standing in front of 100 people and delivering an hour-long seminar. But I don’t know how, and I said yes.\n\nI had the week to prepare for it, but I waited till last night (obviously) and then all those fears came up:\n\n- My whole team will be at the event, what if I deliver a terrible speech and embarrass them?\n- What if no one is interested in the whole back story that I think is critical?\n- What if people laugh?\n- I am risking the whole brand image of RipeSeed on this one, possibly stupid, decision of mine. Whatever I do at that seminar will be linked to the name of the company.\n\nI started preparing for it that night. Wrote the whole thing, started rehearsing, and the plan was to have my phone open and deliver the speech. Or at least look at the bullet points.\n\nThe next day I was at the seminar, my team was there and we were just waiting for the exact time. The hall started filling up and since the topic was interesting, the hall filled up with over 100 students. I tested the mic and without overthinking a lot, I started.\n\nAnd then guess what happened?\n\n\n\nNothing.\n\n\n\nI talked for over 40 minutes, I hardly looked at my phone, was staring at the audience the whole time, was able to crack a few jokes based on some unexpected things happening in the crowd, and made the whole crowd laugh.\n\nOnly if I could explain my happiness at that moment.\n\nBut oh, that, satisfaction ❤️\n\nThe whole crowd clapped at the end, appreciated the seminar, and came up with interesting questions as well. The confidence boost I got that day, the adrenaline rush ❤️‍🔥\n\nStill gives me goosebumps when I think about it.\n\n\n\n----------------------------------------------------------------------\n\nI am posting the journey of building RipeSeed, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "9mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQGFh4ySxN-a9A/feedshare-shrink_800/0/1695394329780?e=1722470400&v=beta&t=ztyBpCTZNx29hK70ClG5h8rOEp_jmT6K_MwsJ375bKs",
        "likes": "122",
        "commentsCount": "7 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-09-21 14:28:15",
        "content": "“But some clients don’t prefer working with companies. They’d rather hire someone independently than hire the company. That much transparency will get you killed” \n\nHeard this so many times and my answer has always been the same. We’d be happy to have less number of clients. That’s fine. The world will not end if we don’t have more revenue in the next month than the previous.\n\nWe are fine with slow growth if that’s the cost of being overly transparent. But I have hardly found that to be the case. The growth seems consistent, it’s scalable because we are not worried about hiding anything from the client, we don’t hide the leave of the employees or national holidays, if someone is sick, we call in sick on the client side, if it’s a public holiday, we don’t invoice for that day.\n\nThe reason some clients don’t prefer working with companies is because of this bad and very common practice of hiding things, hiding resources, over-selling skills, hiding mistakes, and false testimonials.\n\nWe work on new technologies all the time, but not using a fake testimonial, we show them what we have done and that we feel we are capable of doing this new thing as well. And it works all the time (doesn’t work 10-20% of the time)\n\nWe can transform the whole industry and change this mindset of the clients, the moment we all aim to deliver what we promise, show what we have, and be what we are. It works. That's howworks. We are a living example.\n\n\n\n----------------------------------------------------------------------\n\nI am posting the journey of building RipeSeed, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "9mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQHQbn8wdXWzZw/feedshare-shrink_800/0/1695306494494?e=1722470400&v=beta&t=17AMNE7dn_32qhKf36HmmqBWHVW5Ut-kP0i-KT57dNM",
        "likes": "122",
        "commentsCount": "4 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-09-20 14:18:43",
        "content": "”Everything’s your fault”\n\nBack in 2018, I watched a bit too many Gary Vaynerchuk videos (I still do) and this ☝🏼 is one of the things that totally changed my thought process.\n\nThe moment you consider yourself responsible for things happening in your life, you start looking for solutions to the problems instead of the person or reason to blame.\n\nIn my personal or professional life, I take 100% ownership, no questions asked.\n\n- Someone mishandled a client? My mistake. I should have appointed the right person for the job.\n- Someone took a good client of ours? My mistake, we weren’t able to build a relation, strong enough to retain the client.\n- We are not able to deliver on-time? My mistake, I should have taught my team better about how to give better estimations.\n- Our sales target were not met? My mistake. I should have been more in touch with the day-to-day of how sales were going\n- Some critical person left the company? My mistake, I should have been in touch with them about their goals\n- Someone messed up my mood? My mistake, I expected too much from them.\n\nWith this mindset, you start to look for solutions, you start to build processes, so you can avoid making such “mistakes” in the future.\n\nThe key to this thought process is not to blame yourself, but to consider yourself in control of things happening in your life. It creates a problem-solving mindset and you unknowingly start building a process that is immune to any outside negative influence.\n\nHere's the link to that original Gary Vee video:\n\n\n\n----------------------------------------------------------------------\n\nI am posting the journey of building RipeSeed, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "9mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQEQpXyoZ4Na7Q/feedshare-shrink_800/0/1695219520156?e=1722470400&v=beta&t=a2447hMokesqEp7ZYKjTAmIMPjAHfqcGhVKsbT6yA-A",
        "likes": "86",
        "commentsCount": "5 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-09-19 12:01:26",
        "content": "\"I am sure you are not writing all of those long posts on LinkedIn these days. That must be someone else or ChatGPT\"\n\nMet a friend yesterday who said this and I think I couldn't have received a better compliment. Most of my friends know me as the person on the left side (that's me from 2016 when I was in university).\n\nI am glad I am not the same and I have evolved a lot in the past few years. So much so that people don't recognize me or believe me when they see this version of mine.\n\nNow, I know posting motivational quotes sounds a bit too cliché, but I wanna end this post with a quote I heard a long time ago that stuck with me.\n\n\"The only thing standing between you and your goal is the bullshit story you keep telling yourself as to why you can't achieve it.\" -\n\n\n\n----------------------------------------------------------------------\n\nI am posting the journey of building RipeSeed, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "9mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQE3NToJ9jjp6g/feedshare-shrink_800/0/1695124884262?e=1722470400&v=beta&t=eVCmnxQ1EgkchFHgtDpNf-k-Y6tR4DgkZ8ak92wOip4",
        "likes": "204",
        "commentsCount": "8 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-09-18 13:36:59",
        "content": "Under-promise 📈 & Over-deliver 💹\n\nThis is one of our key principles at RipeSeed. One of our ground rules is to tell the clients right away about what we are experienced in and what’s going to be a new problem for us. I adopted this habit back in 2018 when one of my earliest clients approached and asked for a mobile app for private security companies in the US. That problem was very interesting to solve and I had the skills of App development, but I had virtually zero experience with AWS. So this is what I did:\n\nUnder Promise: Had a quick look at the documentation of the services that we’ll be using in the app and told the client that I don’t have any experience with it at all, but I have seen the docs and I think I can do it. The client trusted my word and honesty that I was transparent and awarded the project. I asked for a month to deliver the initial version.\n\nOver Deliver: With the deadline of 1 month, I worked hard to learn everything needed fromside of things and delivered the whole functional app, ready to release in ~25 days. That strengthened the client’s trust in me and that client turned into one of my longest-term clients, whom I still work with to this date.\n\nAnd this strategy has worked for us time and time again. Instead of the general practice of over-promising everything in sales, we do it in reverse fashion.\n\n1. A client was impressed with our previous work for him and asked us to work on Chrome extensions. We told them it was out of our skillset but willing to do it. We outperformed the expectations and the client engaged 5 engineers from our team for his ongoing projects. Now browser plugin development is one of our highest in-demand expertise.\n\n2. We started working on Generative AI back in December 2022 with 0 experience whatsoever and told the client right away. He trusted us, we delivered and now Generative AI is one of our most in-demand skillset and that client always spreads good word for us whenever we put him in referrals.\n\nThis strategy has helped us increase our area of expertise, by maintaining and improving our client relations as well. No good client wants to hear that you are a know-it-all person. Any real person or company cannot have everything under their portfolio. It makes absolute sense to admit what you don’t know, but being open to learning what you can. And if the client only wants someone who has worked on everything that his project needs, he probably isn’t going to prove a patient or a good client in the longer run anyway. So… best of luck 🙌",
        "date": "9mo • \n ",
        "image": "",
        "likes": "42",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-09-15 13:42:46",
        "content": "How much part does luck play in one's journey? A LOT!!! \nThen what can we do about it? Increase the chances of luck wherever you can!!! \n\nWhenever I tell someone about our journey or how we got some good clients, good team members, good connections, I cannot resist saying “But I think I got lucky”\n\nAnd I truly mean it.\n\n1. What if I was away watching a season or sleeping or away from my phone when that very good client who was critical for our survival reached out, and I couldn't respond to him right away? What if someone else responded him earlier and impressed him?\n\n2. What if I got into some wrong group of people and went on a wrong career trajectory?\n\n3. What if I underestimated a particular networking event and skipped that, the one from which I got some very good connections?\n\nThe answer to most of these what ifs is same. Increase your chances of luck. In sales, and especially in cold outreach, it's the game of numbers, more than quality. You can write a perfect proposal, but your prospect gets tired after reading 8 proposals and yours was 9th. You can dedicate 2 hours of your day reaching out to new clients, but someone else was dedicating 8 hours of their day and their probability is already 4x yours.\n\nSo even though you cannot control luck directly, you can control the probability of being lucky.\n\nMeet more people, network more, and you only need 1 or 2 people who can prove an excellent connection for you.\n\nSomeone who doesn't network at all, has extremely little (if not 0) probability of meeting someone of value, as compared to someone who met 200 people in 10 networking events in a month.\n\nSomeone who sends 2 proposals a week has very little probability of hearing back from a client as compared to someone putting in the work of sending 100 proposals a week.\n\nSo even though you cannot control your luck, you can surely increase your chances of it. Best of luck!\n\n\n\n----------------------------------------------------------------------\n\nI am posting the journey of building RipeSeed, the challenges I have faced, and how I solved them, here on LinkedIn, on a daily basis. Always looking for help and suggestions, and always happy to help anyone I can.\n\nIf you are someone who can benefit from it, don't forget to \"Follow\", \"React\" and \"Repost\", so this content can reach anyone who could benefit from it.",
        "date": "9mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQHp0pIQqCYA9A/feedshare-shrink_800/0/1694785364875?e=1722470400&v=beta&t=HnRXfv4TybDsa80h6uamaDXix2AdhyEW3VpcP_klLiI",
        "likes": "68",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-09-15 07:24:34",
        "content": "I think people can't appreciate the correctness of this statement enough.\n\nI started with Android development and learned the whole thing from \"Android Programming: The(2nd edition)\". That book taught me how to \"build software\" using the right practices, in a scalable manner, implementing the right design patterns, and a lot more.\n\nLater on, when I started doing web, desktop, and backend development, I started using the same practices, folder structures, and patterns in everything. People used to be surprised seeing my code but that was the \"norm\" for me. It felt natural to me to code that way.\n\nPeople should really consider mastering \"software development\" instead of just taking crash courses in web and mobile apps these days.",
        "date": "9mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4E03AQG3ESM3HOO5rA/profile-displayphoto-shrink_100_100/0/1682953761897?e=1724889600&v=beta&t=rLIIhl6fKCii7Aldwqh3xACAQcrys5bBgV6IgvVY8t0",
        "likes": "3",
        "commentsCount": "",
        "sharedBy": "Kevin Naughton",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:7108073419379806208/"
    },
    {
        "postTime": "2023-09-14 13:42:56",
        "content": "The Key-Man Problem 🔐\n\nEver heard of it? It is a phenomenon when a business or some operations are totally reliant on any one individual, his expertise, his connections and his skills. Remember when in Breaking Bad 🧪, Walter White 👨🏻‍🦲 said to Skyler in that famous “I am the one who knocks…” scene:\n\n”Do you know what would happen if I suddenly decided to stop going into work? A business big enough that it could be listed on the NASDAQ goes belly up. Disappears! It ceases to exist without me.”\n\nWalt was the Key Man. Is that a good thing? For your self-esteem, maybe, for your work-life balance, for a business to thrive, absolutely not.\n\nIn the early days of RipeSeed, I faced a similar situation. I was the key “Engineer”. Only I knew how to work on complex projects, how to set up CI/CD, or work on complex cloud workflows, but that’s the first thing that you solve in any software services business, right? You train your team and transfer the skills. So that’s what we did and I got out of that. But that was one of the many things we needed to solve.\n\nWhat about sales? The heart of any business. I was doing all of the cold outreach, and I was stuck with it. I was doing the outreach via Upwork and we were doing near-stable revenue, but I had no idea about cold calling and email marketing and that’s when I talked to, I consider him my mentor. Most of what I do, is what I learnt working with(they are amazing, check them out). I asked him how do I scale the sales. And his advice was “Just delegate what you do to your team, don’t do anything new with the sales team, if you are doing upwork, ask your team to do Upwork as well” That was kind of a validation, and I started doing that. We started a sales team, we did some initial training and the team started generating leads which started converting to clients. One more problem solved.\n\nNow I wasn’t doing the outreach, but I was still the one replying to the client whenever a lead responded. For quite some time, it continued on like this. Sales generated leads, and I did the interaction with the client. But I needed to remove myself from this part as well. So we started Client Success Team. A team of super-talented engineers, who’ll do the early interactions with the client, from their OWN account through the Agency (no shadowing, no imitating), whenever a lead responds. This took off.\n\nThe engineering 👨🏻‍💻 The sales 💰 The client success 🤝\n\nEverything running without any reliance on any single person. I proudly say that some of our clients don’t even know my name. They know the CSM they are working with and the engineers involved in the project.\n\nIt’s critical to unlink yourself from the day-to-day of your business so you have the time and mental capacity to think how to scale. To do meetups, build longer-term connections, and invest your time in a longer-term play.",
        "date": "9mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQE1enA1UAcjaQ/feedshare-shrink_800/0/1694698975012?e=1722470400&v=beta&t=4O_b3fZwaj89l2mI05V7-Mk-3KeXjAUe1ZQMORSBET8",
        "likes": "73",
        "commentsCount": "14 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-09-13 12:21:36",
        "content": "Building a crazy talented and responsible team 🧠 🚀\n\nIf you are a developer or a designer yourself, having any particular skills, it’s easier to get started with a services business, because you can sell exactly what you do. But then it’s harder to scale. To find the team to do what you think only YOU can do 🫵🏻\n\nI had been working on Web (Frontend + Backend), Apps, and AWS for around 3-4 years, before I startedin mid-2021. When you are working individually for so long, it’s really hard to trust anyone with the code 💻 You think it’s only YOU, who can do this amazingly complex piece of feature. But you are SO wrong!!\n\nThe first guys I hired left within 2 weeks, my fault, because it was just me and him working side-by-side. He might have felt some pressure. I learned my lesson quickly and the next week, I hired 3 undergraduates. The criteria:\n\n- It won’t be an internship, so the role & responsibilities wouldn’t be like an internship\n- They must be skilled in full-stack development already, apart from being good programmers\n\nSo these 3 people joined the company, who are, I am so proud to say, still with us (thanks,,🙌). We had some projects going on at that moment, using, CloudFormation,,,, it was a complex SaaS application.\n\nI trained them initially, and I was there with them if they faced any issues because I built that platform with my hands. The nerd inside me was afraid if they could do it or not, but they all surprised me. Now, one can say I got lucky with the team, and I would totally agree ✌🏻 but this has proved time and time again for me. You just have to trust your team with the complex tasks, be with them, guide them and they all can do it.\n\nThe criteria we defined for these first three hires, became the foundation of how we hire. So even when we started growing, the criteria remained:\n\n- We won’t hire someone who we need to train on everything. We train on AWS or DevOps or improve their skills, but they have to bring something to the table, Mobile, Web, or Game Development\n- They have to be open to learning new technologies\n- We don’t have frontend-only or backend-only roles, we hire and maintain a full-stack team\n\nThis is how the engineering team offormed and stands to the strength of 28 people today ✊ The ground rules we defined were carried on by the team, which now interviews and hires on these basic principles.\n\nHow we built the sales team and how we streamlined the sales process is a whole different and very interesting story. Which I’ll cover in some other post. But I hope this answers the question that I get asked very often, How do you hire?",
        "date": "9mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFN45XbO3MnNQ/feedshare-shrink_800/0/1694607695201?e=1722470400&v=beta&t=v2EdvQ5qCs-a3Npn0r403qfZQCmDfsUxh_Scnk_AgbI",
        "likes": "121",
        "commentsCount": "5 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-09-12 12:46:18",
        "content": "When starting something new, it’s really critical to stay laser-focused on what and why you want to do something. Is it going to be beneficial for your goal or is it going to just look and sound “cool”? I am glad we could avoid most of those things in our early days and till today as well. Some of those things are:\n\nCool Workspace 🏤 Having a cool office space with grass and wooden floors, paintings on the walls, play stations, and a nice book rack in your office, is something that'd really look amazing, but, how critical is that? Is the current look and feel too bad? Should we be channeling our energies into making the office look cool or should we invest that amount in our talent, in bonuses, and in experimentation? The answer was obvious.\n\nThe Product Trap 🪤 This is the most critical one I’d say. If you start with the mindset of being a client-service company and you start doing products to keep the team busy, you are doing injustice to the product and to yourself as well. The product mindset is totally different from the services mindset. Starting products will make you feel like the team is “occupied”, you’ll be doing “product planning meetings”, you’ll be focused on building a product while finding new clients alongside. You’ll feel like you are busy and doing something, but instead, that won’t be generating any value that's crucial to the survival of the company.\n\nEntertainment 🏄🏽 We invest heavily into team satisfaction in forms of competitive packages, a nicer culture, good & and timely (timely is the important part) bonuses, and company-wide monthly dinners. But we never went on a company-wide trip for the whole first two years. The first time we went for one, was on the 2nd anniversary of the company. It’s critical to slowly raise the bar of your entertainment/fun standards, instead of just starting right from the top. This gives you and everyone the sense of validation as well, that we are making progress.\n\nBecoming a US-based Company 🇺🇸 Now I won’t say you shouldn’t, but we never really considered registering ourselves outside of Pakistan as something of higher priority. Yes, the majority of our clients are from the US, but we tell them right away that we operate from Pakistan and we have a physical office space here. It never made sense to call ourselves a US-based company when you have never been there and the team is not operating from the US. We proudly work from Pakistan 🇵🇰 and our clients work with us for quality, trust, and transparency.\n\nNow I won’t say that we will never do the things mentioned above. We will, for sure, as the need arises, but not focusing on them for the good two years helped us stay focused, generate more backup, scale the team by offering better incentives, and I always recommend everyone to do this.\n\nIn some future posts, I'll list the things we did in the early days that I think we could've avoided.",
        "date": "9mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFW_MMXd8iydg/feedshare-shrink_800/0/1694522774099?e=1722470400&v=beta&t=dRR3Y8i6S4NSynw9g_HlBRYd2Y_we33l3jAzktEkpO8",
        "likes": "59",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-09-11 11:19:08",
        "content": "This picture is from October 2021, when RipeSeed made some initial hirings in the company and scaled from a team of 1 to 5. \n\nWe had some ground rules, we defined some rights and wrongs of starting/running a company. The rule was to try and scale the business by doing things that \"can scale\". That can prove beneficial to everyone involved in the process. The rules were:\n\n1. Brutal Honesty 🩸 We'll stay true to what we can do and what we can't. Even if we want to work on something new, we'll just tell the clients that we don't have the experience but we think we can do it. Clients were always impressed by it and most of the time agreed to it.\n\n2. Quality of Team 💪 We hired the best talent, under-graduates, from the most prestigious IT universities, tried paying them above market for under-graduates at that time, and offered bonuses on top of them. So the ones who got engaged on client projects were financially growing along with the company as well.\n\n3. Tech Stack 📲 From the very early days, we started training the team on, Web & Mobile development, CI/CD and started engaging them on real-life projects. AWS is not something every fresh grad or undergrad jumps into. But we were setting a higher bar for everyone and that defined a baseline of excellence in the team.\n\n4. Client Transparency 🤝 No matter what, we'll provide the transparency of engineers involved in the projects. The client will be provided access to talk to the engineers directly. This proved to be beneficial to us in two ways. The clients were super impressed by the transparency and the team gained experience in client interaction in the very early days of their career.\n\n5. Pay High, Charge High 🏦 We defined a base rate for our services, so no matter what happens, we never cross that threshold. We will always charge above that hourly rate. We will never market ourselves as the cheapest providers. We'll sell ourselves on our quality, our transparency, our honesty and our skills. This helped us maintain a higher-than-market or market-competitive package for our team and retain the team for a longer period of time.\n\n6. Agency from Day 1 🏤 And boy was it hard to convince the clients to work with agencies!!! But the rule was to always tell them in the first meeting that it's an agency. For some, it was a no-go. But that was our red line. We never tried to acquire any client by presenting ourselves as individuals and hiding a team behind us.\n\nI can write many more pointers but just don't wanna clutter the post. It's been over two years since this picture was captured, and I can proudly sayis still standing true to these rules.",
        "date": "9mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQFm4_latU4Nrw/feedshare-shrink_800/0/1694431146535?e=1722470400&v=beta&t=EWcDoriuTUfAY0w2LdGIZY93_Zmy8rVlG0gVgpORAPs",
        "likes": "212",
        "commentsCount": "24 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-08-21 11:41:15",
        "content": "Had an amazing time meeting these amazing bunch of people from every corner of the world, trying to make the world a better place with their businesses and innovations. Much thanks to Iqra Expand in Dubaifromfor arranging such a nice activity and her hospitality.\n\nThanks to the speakers&fromfor delivering the amazing session on how we can grow and build a business entity in Dubai. So if anyone in my connections is looking to go for it, I can connect you with these nice people.\n\nIt was a pleasure to learn about the businesses and discuss the potential collaboration opportunities offrom,from,from,from,fromand once again,🙌🏼\n\nIf anyone in my network need help with:\n\n- Leadership, Professional or personal Coaching\n- Staffing needs with large number of engineering and management talent\n- Crypto payments solution provider\n- Raising funds for their startups in Dubai\n- Some true futuristic home automation for enterprise building\n- Expert level cloud consultation to manage and orchestrate their infrastructure\n- Investing in Real Estate segment in Dubai\n\nPlease reach out to me. I'll be able to connect you with the relevant people here in UAE and hope to help you and them grow their businesses together.\n\nAs for me, I am always a message away for anyone looking for any sort of technical consultation to help them understand how they can optimize their businesses through proper use of technology, or if their startup or product idea is worth investing in or not, by creating a minimal viable product for them.\n\nI am here in Dubai till 26th of this month, so happy to meet up with anyone who I can help.",
        "date": "10mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQGr7Uv2Vugv5A/feedshare-shrink_800/0/1692618073115?e=1722470400&v=beta&t=u-BTZR8G7I4lTw1ym-xgsUMs8hCeuuGLD6xJ-gI90nw",
        "likes": "135",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-08-18 08:54:39",
        "content": "Had a chance to attend the amazing networking events organized by Dubai Syndicate & KOVALYS CONNECT and got to meet these amazing bunch of people from very diverse set of businesses. \n\nSpecial thanks to&for organizing such productive events.\n\nTruly enjoyed the thoughtful discussions and possible collaboration opportunities withfrom,from,from,from,&from,,,and a bunch of other amazing people.\n\nI am in Dubai till 26th of August, so if anyone is here and want to meet, have a fun chat or just wanna explore Dubai together, I'd love to connect with you.",
        "date": "10mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQEH3vhoqGKhDQ/feedshare-shrink_800/0/1692348877398?e=1722470400&v=beta&t=zoOIZg6h91r8KfFB-Y6l4p6rDYlJ8UcPGZNcUpsi5OQ",
        "likes": "75",
        "commentsCount": "5 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-08-11 11:38:53",
        "content": "A sneak peak of Thrilling Adventures in Northern Bliss: From Exploring Ayubia Park to Embracing the Splash at Khanpur Dam!",
        "date": "10mo • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/D4E03AQF5iOwHjAfBGg/profile-displayphoto-shrink_100_100/0/1678167415920?e=1724889600&v=beta&t=LapSxPdtX2ZAlf59-Avnshuo15pmML6kptdZglKTX8o",
        "likes": "33",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-08-11 08:15:08",
        "content": "RipeSeed Army is now 28 people strong ✊ 2 years old 🏆\n\nOn July 27th, 2023, RipeSeed turned 2 years old and to celebrate this achievement, we took a company-wide trip to northern areas 🏔 and Khanpur Dam 🌊 I remember our first anniversary, we had a team size of around 18 people. So we have definitely grown in headcount.\n\nWe achieved multiple goals in the last 6 months ⭐️\n\n💵 We crossed our highest-ever monthly revenue\n🏅 We became Expert-Vetted and crossed half a million USD in revenue on\n🎯 We successfully and timely delivered bonuses and annual appraisal\n🤝 Our team retention rate is extremely high, multiple team members completed 2 years of tenure and various team members got promoted in their roles\n🧠 We now have our Sales Team and Client Success Team, working in sync, to regularly talk to new clients, deliver quality work, and maintain good relationships with existing ones, without dependency on any single individual\n🤖 We rode thewave pretty soon enough, even before the ChatGPT-API was out, and for the past 6 months, we have completed various AI-based projects, and got one of our projects featured on\n\nProud to have this amazing bunch of people with me and I hope we achieve many more milestones for many years to come 🤜🏻🤛🏻",
        "date": "10mo • \n ",
        "image": "https://media.licdn.com/dms/image/D4D22AQF1WZwI9Q3T8w/feedshare-shrink_800/0/1691741706836?e=1722470400&v=beta&t=nBGRRzBJKBgiAdT9PkT62Tuyv4gvJXC2MJ72dNBkToA",
        "likes": "143",
        "commentsCount": "16 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2023-04-26 07:51:36",
        "content": "RipeSeed just crossed half a million USD in revenue on Upwork 🎉\n\nStarted in July 2021, I never imagined we'll be able to grow at such a rapid pace. We are now a team of over 25 people, each and everyone contributing significantly to where we are today.\n\nEvery initial stage company faces a lot of issues while trying to scale up. You are continuously hit by sudden revenue declines, client's ramping down, delivery challenges, and people management issues. Scaling from team of 1 to 4 then 4 to 6, to 10, to 15 to 20 and now over 25, each and every stage required us to unlock a specific set of challenges that we had to face along the way.\n\nBut I believe we got lucky in so many things as well. We are lucky to have such an exceptionally talented team that keeps coming up with ways to improve our technical strengths and deliver quality work. We are lucky to have been able to get new clients whenever we need them. There have been times when some crucial clients just disappeared or ramped down and it seemed like it's going to be hard, but something happened and new even better clients came up and we got back on our track. I consider that an absolute luck and some special sort of blessing upon us.\n\nThe goal has always been to be the \"good ones\". Both to our team and to our clients. We try to actually incentivize the ones who are contributing towards the success of the company instead of just giving them hope that they will be compensated for their contributions. We stay true to our clients by being transparent about our processes and our expertise. We believe in under-promising and over-delivering and apparently, it's been working out pretty well for us.\n\nIt has worked out better than I could ever imagine and fingers crossed for whatever is ahead of us.",
        "date": "1yr • \n ",
        "image": "https://media.licdn.com/dms/image/D4E22AQFBgMQJofMW2g/feedshare-shrink_800/0/1682495494540?e=1722470400&v=beta&t=FYDKeHCORrCRMRcmz4nPVZGPRIRg7jQuitv4MfLy5Hc",
        "likes": "279",
        "commentsCount": "60 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2022-09-13 07:53:16",
        "content": "Apply guys! We are hiring highly skilled & talented individuals. \n\nhashtag\n#hiring \nhashtag\n#fullstackdeveloper \nhashtag\n#mernstack \nhashtag\n#react \nhashtag\n#hr",
        "date": "1yr • \n ",
        "image": "https://media.licdn.com/dms/image/D4D0BAQHqCkXj3H3aRA/company-logo_100_100/0/1694153319080/ripeseed_logo?e=1727308800&v=beta&t=57r4mWIxhJW23i36Fl9OmzbkraNwuWhmDxspbMfoxYY",
        "likes": "12",
        "commentsCount": "",
        "sharedBy": "RipeSeed",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:6975343684921749504/"
    },
    {
        "postTime": "2022-09-12 07:44:15",
        "content": "Listen to Alex! 📢",
        "date": "1yr • \n ",
        "image": "https://media.licdn.com/dms/image/C4D03AQH7CBPadlA8ag/profile-displayphoto-shrink_100_100/0/1660762224378?e=1724889600&v=beta&t=E_HFdr3yj9OkO0P0TqkHFudaDEIvaAYGQF0NMesuBhI",
        "likes": "13",
        "commentsCount": "",
        "sharedBy": "Alex Olthoff",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:6974704419749666817/"
    },
    {
        "postTime": "2022-07-29 06:05:23",
        "content": "Indeed!\n\nhashtag\n#anniversary \nhashtag\n#oneyearanniversary \nhashtag\n#growth \nhashtag\n#celebrations",
        "date": "1yr • \n ",
        "image": "https://media.licdn.com/dms/image/D4D0BAQHqCkXj3H3aRA/company-logo_100_100/0/1694153319080/ripeseed_logo?e=1727308800&v=beta&t=57r4mWIxhJW23i36Fl9OmzbkraNwuWhmDxspbMfoxYY",
        "likes": "34",
        "commentsCount": "8 comments",
        "sharedBy": "RipeSeed",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:6958650288824041472/"
    },
    {
        "postTime": "2022-07-27 17:57:00",
        "content": "Never imagined we'll be able to achieve so much in just a year. \nRipeSeed is officially 1 year old today 🎉\nAlhamdulillah!",
        "date": "1yr • \n ",
        "image": "https://media.licdn.com/dms/image/D4D0BAQHqCkXj3H3aRA/company-logo_100_100/0/1694153319080/ripeseed_logo?e=1727308800&v=beta&t=57r4mWIxhJW23i36Fl9OmzbkraNwuWhmDxspbMfoxYY",
        "likes": "24",
        "commentsCount": "3 comments",
        "sharedBy": "RipeSeed",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:6957939893440245760/"
    },
    {
        "postTime": "2022-07-19 23:15:27",
        "content": "\"Take a nap!\" \nWorks 90% of the times!",
        "date": "1yr • \n ",
        "image": "https://media.licdn.com/dms/image/D5603AQHRQGsqHHHgVw/profile-displayphoto-shrink_100_100/0/1707687874793?e=1724889600&v=beta&t=Lnviz-SlHkzznZqsZzdEV8XeRZ8OwUhetGv04wuTLg0",
        "likes": "8",
        "commentsCount": "",
        "sharedBy": "Addy Osmani",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:6955240321035214848/"
    },
    {
        "postTime": "2022-05-27 05:24:10",
        "content": "✌🏻",
        "date": "2yr • \n ",
        "image": "https://media.licdn.com/dms/image/D4D0BAQHqCkXj3H3aRA/company-logo_100_100/0/1694153319080/ripeseed_logo?e=1727308800&v=beta&t=57r4mWIxhJW23i36Fl9OmzbkraNwuWhmDxspbMfoxYY",
        "likes": "9",
        "commentsCount": "",
        "sharedBy": "RipeSeed",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:6935529365405339648/"
    },
    {
        "postTime": "2022-05-17 15:49:49",
        "content": "Hey Fastians!\nWe are coming to GeekWeek 2022. Join us for our talks/workshops and don't hesitate to drop your CVs at our hiring booth. We are still hiring and looking for super talented individuals.\nSee you all there!\nNote: The workshop is only limited to Fastians at the moment.",
        "date": "2yr • \n ",
        "image": "https://media.licdn.com/dms/image/D4D0BAQHqCkXj3H3aRA/company-logo_100_100/0/1694153319080/ripeseed_logo?e=1727308800&v=beta&t=57r4mWIxhJW23i36Fl9OmzbkraNwuWhmDxspbMfoxYY",
        "likes": "17",
        "commentsCount": "",
        "sharedBy": "RipeSeed",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:6932318870825222145/"
    },
    {
        "postTime": "2022-01-19 12:35:26",
        "content": "hashtag\n#hiring",
        "date": "2yr • \n ",
        "image": "https://media.licdn.com/dms/image/D4D0BAQHqCkXj3H3aRA/company-logo_100_100/0/1694153319080/ripeseed_logo?e=1727308800&v=beta&t=57r4mWIxhJW23i36Fl9OmzbkraNwuWhmDxspbMfoxYY",
        "likes": "11",
        "commentsCount": "",
        "sharedBy": "RipeSeed",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:6889542648256847872/"
    },
    {
        "postTime": "2021-12-24 19:16:44",
        "content": "To apply, email us at hr@ripeseed.io\n\nRipeseed is hiring! Software Engineer (React / AWS) needed to join our dynamic team with a full-time on-site position. If you think you're a good fit, shoot us an email! More details on the post below!",
        "date": "2yr • \n ",
        "image": "https://media.licdn.com/dms/image/D4D0BAQHqCkXj3H3aRA/company-logo_100_100/0/1694153319080/ripeseed_logo?e=1727308800&v=beta&t=57r4mWIxhJW23i36Fl9OmzbkraNwuWhmDxspbMfoxYY",
        "likes": "8",
        "commentsCount": "2 comments",
        "sharedBy": "RipeSeed",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:6880139118106439680/"
    },
    {
        "postTime": "2021-12-01 07:45:42",
        "content": "Immediate hiring.\n\nhashtag\n#hiring \nhashtag\n#fullstack \nhashtag\n#cloud \nhashtag\n#react",
        "date": "2yr • \n ",
        "image": "",
        "likes": "26",
        "commentsCount": "4 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2020-12-04 09:49:41",
        "content": "Do apply if you are looking for an opportunity in a similar role.",
        "date": "3yr • \n ",
        "image": "https://media.licdn.com/dms/image/D4D03AQFdzDaJK2KwEw/profile-displayphoto-shrink_100_100/0/1708947403055?e=1724889600&v=beta&t=R7mxYYrkqsouMtjiZfiev9jsX7oOJE_b9lKPTvASeoA",
        "likes": "4",
        "commentsCount": "",
        "sharedBy": "Muhammad Amsal Naseem",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:6740554227321475072/"
    },
    {
        "postTime": "2020-08-24 10:00:15",
        "content": "1 down.",
        "date": "3yr • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/sync/C4D27AQFDgCoDJdJF_w/articleshare-shrink_480/0/1710999895061?e=1720008000&v=beta&t=_NjBbm5N_PzMQ5i7Zelb8SZFZHydKqvni2EEGTl5RlA",
        "likes": "69",
        "commentsCount": "6 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2020-07-15 22:42:33",
        "content": "React Spectrum - A new React UI toolkit based on Adobe's design system\n\nDocumentation looks good. Much like Material UI's documentation. A great initiative by Adobe but still needs some time to compete with Material-UI.",
        "date": "3yr • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/sync/C5627AQGr5yZRESykwA/articleshare-shrink_480/0/1714161515868?e=1720008000&v=beta&t=WRYKhvKYT_skVPX4ckJcWk38K6xvlCI_zp771Uvfnyw",
        "likes": "29",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2020-05-29 13:22:02",
        "content": "Forem just introduced \"Forem\". An opensource tool for building platforms (or communities as they say) like dev.to. Haven't seen anything like this before. Amazing work by Ben Halpern and everyone at\n\nThey literally just published a tool to make platforms exactly like theirs. Totally amazed to see how they open-sourced their years of effort and made it available to the public in the form of a dedicated tool.",
        "date": "4yr • \n ",
        "image": "https://media.licdn.com/dms/image/sync/D4E27AQHxdi-1MP4McA/articleshare-shrink_480/0/1711678932977?e=1720008000&v=beta&t=UdFBWc6GJLZYmBHM5hKoKJt-UWrAkd_xF-S0EUwvKFY",
        "likes": "20",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2020-05-23 21:06:47",
        "content": "Just published my first package to NPM repository. ✅\n\nhttps://lnkd.in/e2FSQ-F \n\nRecently while working on a client's project, I had an issue setting proper ContentType of files while uploading them on S3 via a Lambda event. Tried a lot of existing solutions but none of them completely solved my issue.\n\nSo I created this simple JavaScript library. You can read this article to know more details about how I approached the solution and created this library that works for more than 600 MIME types.",
        "date": "4yr • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/sync/C5627AQEZAZFmMZaipg/articleshare-shrink_480/0/1718282225498?e=1720008000&v=beta&t=CMkVvuCFW-IzPiH1OHYh4Q7Jdr0YPI_A4FF-UkmSkaY",
        "likes": "55",
        "commentsCount": "9 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2020-05-16 23:29:13",
        "content": "An amazing article on React's Architectural patterns by Sebastian Deutsch. \n\nI was looking for some better approaches to handle routing in react when I came across this article. Found some really useful architectural patterns to solve various problems in a very simple and scalable manner.",
        "date": "4yr • Edited • \n ",
        "image": "https://media.licdn.com/dms/image/sync/C5127AQFB_BgjIbmkdQ/articleshare-shrink_480/0/1718282225937?e=1720008000&v=beta&t=ozmkjeiQe9lu0Kn43oqXwJyD3WV7CrC8JoArW3XLWbQ",
        "likes": "10",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2020-03-27 16:45:22",
        "content": "In these times of uncertanity, Team Amplifyd wishes you all the best of health and spirit. \nhashtag\n#stay_home and \nhashtag\n#stay_safe.\n\nhashtag\n#covid19 \nhashtag\n#coronavirus \nhashtag\n#workfromhome \nhashtag\n#telecommute \nhashtag\n#team",
        "date": "4yr • \n ",
        "image": "https://media.licdn.com/dms/image/C510BAQGV57dAdVaC1Q/company-logo_100_100/0/1630571230925?e=1727308800&v=beta&t=ra6sJnJtyeyEjQR1gtZbgMks-Y98sbr6UXIJpsF-st4",
        "likes": "3",
        "commentsCount": "",
        "sharedBy": "Amplifyd",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:6648978676279062528/"
    },
    {
        "postTime": "2019-12-12 19:50:44",
        "content": "Words !",
        "date": "4yr • \n ",
        "image": "https://media.licdn.com/dms/image/D4D03AQGyMl5NLdb79Q/profile-displayphoto-shrink_100_100/0/1689760003426?e=1724889600&v=beta&t=LjWoycx8TfRBmaah7IQCB6RGg1pqGleyia7rYSP88QY",
        "likes": "",
        "commentsCount": "",
        "sharedBy": "Dr. Syed Hassan Amin",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:6610791636496670720/"
    },
    {
        "postTime": "2019-11-21 04:53:17",
        "content": "Looking for Rails developers for full time position. Refer people in comments or share. Thanks. \nhashtag\n#hiringalert \nhashtag\n#railsdevelopers￼\n\nApply directly at jobs@logicon.com.pk",
        "date": "4yr • \n ",
        "image": "",
        "likes": "4",
        "commentsCount": "",
        "sharedBy": "Adil Sarwar",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:6602999743377481728/"
    },
    {
        "postTime": "2019-10-25 06:37:28",
        "content": "Absolutely love it how Android Studio crashes in almost every Developer conference and they totally embrace it with nerdy jokes and geeky humor!\nhashtag\n#AndroidDevSummit \nhashtag\n#Google \nhashtag\n#Android",
        "date": "4yr • \n ",
        "image": "https://media.licdn.com/dms/image/C4E22AQH24LWv0ya8Pw/feedshare-shrink_800/0/1571985447411?e=1722470400&v=beta&t=9HHXOXhQL6HRudENERhRA0uKX2RxCu_TO-_PgP8-tKI",
        "likes": "27",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2019-08-23 06:43:22",
        "content": "Here's another article that I wrote specifically on one of the apps I built as part of that \"failed\" challenge I mentioned in my previous post. This is one of the most favorite app of mine I have written in flutter. It's a simple one screen social-utility app but the clean UI and animations makes everything look really beautiful.\n\nI am referring to it as \"social-utility\" instead of \"social-networking\" because it's purpose is not to stick you on your phones for as long as possible. Instead, it just serves the purpose to give you an insight about how the people of world (user's of app to be more specific) are feeling today. The purpose is not user engagement, the purpose is just to provide this simple insight in return to the user's own contribution towards the \"feeling's count\".",
        "date": "4yr • \n ",
        "image": "",
        "likes": "14",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2019-08-20 07:53:57",
        "content": "One of my recent development experience.\n\n\"I took 30 apps in 30 days challenge with flutter, I failed and I don't regret\"",
        "date": "4yr • \n ",
        "image": "",
        "likes": "34",
        "commentsCount": "6 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2019-08-09 06:17:55",
        "content": "So finally!!! Graduated from FAST! 🎓\nOne of the best days of my life. Felt really great to make my parents proud of me.",
        "date": "4yr • Edited • \n ",
        "image": "",
        "likes": "92",
        "commentsCount": "16 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2019-08-06 06:25:31",
        "content": "I've been huge advocate of Native-platform specific app development for long time. But for the past two weeks, I have been working on Flutter and it's just beautiful. I don't think I will ever prefer to work Natively again.\nFlutter is just ❤️",
        "date": "4yr • \n ",
        "image": "",
        "likes": "16",
        "commentsCount": "6 comments",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2019-06-26 13:19:39",
        "content": "Excellent Idea!\n\nTL;DR: Charge your clients a bit higher than you usually do and then donate that amount to open source tools that you are using in your development routine or product.",
        "date": "4yr • \n ",
        "image": "",
        "likes": "7",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2019-05-09 21:34:46",
        "content": "When you have just started getting used to Kotlin, AndroidX and Material 2.0 and Google launches something radically new.\n\nIt's like Google does an I/O and BOOMM you are not an Android developer anymore!",
        "date": "5yr • Edited • \n ",
        "image": "",
        "likes": "16",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2019-03-15 04:16:29",
        "content": "So it's a \"Storyboard\" for Android .... But better!\nInteresting!\nhttps://lnkd.in/gD2g-BC\nhashtag\n#androiddev \nhashtag\n#android \nhashtag\n#uiux",
        "date": "5yr • \n ",
        "image": "https://media.licdn.com/dms/image/sync/D4E27AQH__3yLCzTnhw/articleshare-shrink_480/0/1712207137738?e=1720008000&v=beta&t=W-garb1zS7bFnhPQavHiQCiYZ_nIgS7ymVwUn4nc_ws",
        "likes": "5",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2019-01-05 07:52:39",
        "content": "Looking for iOS developers to work for a new company that is going to start in a few days. \nIf you are interested, kindly fill out the following form. Share with your friends who you think would be interested.",
        "date": "5yr • \n ",
        "image": "",
        "likes": "4",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2018-11-02 12:00:14",
        "content": "Any kind of help will be highly appreciated!\n\nhttps://lnkd.in/ecDd4ZB",
        "date": "5yr • \n ",
        "image": "https://media.licdn.com/dms/image/sync/C4E34AQFMwG4FIGBRVA/ugc-proxy-shrink_1280_800/0/1594119121717?e=1720008000&v=beta&t=cvw2wZI6_4UaUWrMxttqmyt5exYF9fFnomgcti2qSG0",
        "likes": "",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2018-10-26 16:56:20",
        "content": "Need some help with Amazon Web Services.\nI have been working on a product (Android and iOS app) for sometime that index faces of people using AWS Rekognition so when they are scanned later, it identifies them. It's working great when I index a face from an Android device and then try to search it with an Android device. But if I try to search it later on iOS app, it doesn't find it. In short,\nIndex with Android, search with iOS, not found.\nIndex with iOS, search with Android, not found.\nThe collection ID is same while indexing and searching on both devices.\nI have called \"listCollections\" function on both iOS and android apps. Both of them are showing different list of collections. This is the issue. But I can't figure our why it is happening. The identity pool and region is same on both of them.\n\nAnyone who could help me or possibly connect me with someone who can help me, I'd really appreciate that. Thanks.",
        "date": "5yr • \n ",
        "image": "",
        "likes": "",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2018-07-18 18:13:44",
        "content": "Anyone with mac OS(NOT IOS) app development experience?",
        "date": "5yr • \n ",
        "image": "https://media.licdn.com/dms/image/D4D03AQGn6FU43bzgvg/profile-displayphoto-shrink_100_100/0/1715824649771?e=1724889600&v=beta&t=wJ68CLVCuLhVuU1PP4Se_msfdAx7aHTYLqqhuz6zIlo",
        "likes": "",
        "commentsCount": "",
        "sharedBy": "Muaz Maqbool",
        "sharedLink": "https://www.linkedin.com/feed/update/urn:li:activity:6425306856993976320/"
    },
    {
        "postTime": "2018-07-10 08:10:16",
        "content": "Honesty at it's very best.\nhttp://uetoken.com/\n\nAn ICO worth investing in 😂 - for fun!\n#Blockchain #tokens #cryptocurrency #ICO",
        "date": "5yr • \n ",
        "image": "",
        "likes": "",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2018-06-02 17:46:43",
        "content": "It's been 9 Months that Dorch is on Play Store. I developed this app with no intention of targeting any large audience or any promotion. I just developed it because I couldn't find any such app that had this functionality that I need. And without any paid promotion, without any spamming on social media, today Dorch has:\n\n* More than 17000 downloads\n* Rated by 140 Users (4.1 Stars Rating)\n* More than 3000 new downloads per month\n\nThanks a lot to all those users who appreciated me by Rating this app.",
        "date": "6yr • \n ",
        "image": "https://media.licdn.com/dms/image/C5622AQEGFIuazZ47Ng/feedshare-shrink_800/0/1574694190419?e=1722470400&v=beta&t=wJnsmK9S8jG_4prTHwPx8XKihikTI7KO20Ue7mA1Jx4",
        "likes": "17",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2018-02-24 06:51:19",
        "content": "Develop an Android/iOS App and win Prizes worth 30000 PKR. Participants will develop the required app at home and get them evaluated on the day of event.\n\nSo hurry up and register for DevFest because last date of registration for DevFest is February 28th 2018.\n\n1-3 Members/team\nFee: 2500 PKR\n\n\n\nFor event details:\n\n\nFor any queries, feel free to message at:\n\n\n\nAnd we promise you this again. Bigger, better and more Geekyyy !!\n#GeekWeek18\n#BiggerAndBetter\n#UltimateExperience",
        "date": "6yr • \n ",
        "image": "https://media.licdn.com/dms/image/C5622AQHi4-yHaPDxpw/feedshare-shrink_800/0/1581209872759?e=1722470400&v=beta&t=1Ul8GrC3-J0jOzf8o64KQJnaejJznTTbFGnsT8cNbq0",
        "likes": "",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2018-02-22 19:03:37",
        "content": "Alhamdullilah!\n1st Runner Up in AppX Battle of Ideas Competition held by ImpTrax Corporation! Won Cash prize worth Rs. 25000.\nWell done Taha Shahid, Saboor Elahi & Muneeb Ahmad. It was a team effort that we won this competition!\nThanks a lot to everyone who was present there to support us and the whole AppX Idea Convention team for carrying out such a great competition.",
        "date": "6yr • \n ",
        "image": "https://media.licdn.com/dms/image/C5622AQHJsQfx7fpBYg/feedshare-shrink_800/0/1581182983112?e=1722470400&v=beta&t=s-s5OT_EcBMKXWUn7dXaCG_MFVIADkldGB02DnARrPE",
        "likes": "11",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2017-09-24 17:32:50",
        "content": "Reasons to be an Android Developer:\n10% - I want to make apps so I can serve others\n90% - Meh, just wanna write some cool changelogs!",
        "date": "6yr • \n ",
        "image": "https://media.licdn.com/dms/image/C5622AQGizYmKhyFHKQ/feedshare-shrink_800/0/1582068079488?e=1722470400&v=beta&t=WwELccBPeVkytun8iB1RPVePDRIeCUnEfypoiXYVIrk",
        "likes": "3",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2017-09-10 15:11:34",
        "content": "Dorch - Dual Torch - Flashlight app for devices with both front and back flash!\nI recently got a new phone and it had both front and back flash. So - as usual - I just searched for some app that could toggle both of them but couldn't find any such app. So for my own use (and others who want to) I developed this simple Android app that can be used to toggle both front and back flash for devices with supporting hardware. So if you ever needed any such app, do check it out.\n\nSupported Android Versions: 6.0+\n\nPlay Store Link:",
        "date": "6yr • \n ",
        "image": "https://media.licdn.com/dms/image/C5622AQHEULgW6-LKfA/feedshare-shrink_800/0/1582074447285?e=1722470400&v=beta&t=k1KlFhxTvcxoG7-a9yyDDnYedbL4jjRjx1MUrGaRI7w",
        "likes": "",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2017-08-25 14:44:40",
        "content": "Biselahore Automated Result Fetcher -\nThis tool is an Automated Bot that takes as input the list of Roll Numbers of students and then automates the task of opening each result in browser and fetching their subject wise marks.\nAt the end of execution an Excel Sheet will be created with complete marks details of each student.\nI created this tool for some personal use and now open sourced it. So anyone who finds it interesting can use it or modify it for their use.",
        "date": "6yr • \n ",
        "image": "https://media.licdn.com/dms/image/C5622AQEaWzaaCZ17RQ/feedshare-shrink_800/0/1576644986092?e=1722470400&v=beta&t=x1QVgyzrAeeC2WC9ZVU5aEPhZQc3uHVzcjZjyUknZ9M",
        "likes": "3",
        "commentsCount": "",
        "sharedBy": "",
        "sharedLink": ""
    },
    {
        "postTime": "2017-08-12 17:38:25",
        "content": "It's been more than a month that Evenz - my first app - is up on Play Store. \nEvenz is created with the idea of promoting and celebrating National, International and University Events by providing frames that can be applied to images so that people can show their love and interest for the events that matter to them.\nThe way Evenz works, or I plan to continue it, is University Event organizers will design their frames themselves and send me their frames. All frames will be published on our servers after getting verified. The designers will get proper credits for the frames they design as they will be mentioned along with the frames.\nAs 14th August is near, app has frames for Pakistan Independence Day. Do check them out if your are interested.\n\nPlay Store Link:",
        "date": "6yr • \n ",
        "image": "https://media.licdn.com/dms/image/C5622AQHtC2WebpJKIw/feedshare-shrink_800/0/1576022621184?e=1722470400&v=beta&t=Ns4qsNPH9MlLEmUFj0yZATXQQ3_GD-CrPYeqAq5rpoE",
        "likes": "7",
        "commentsCount": "2 comments",
        "sharedBy": "",
        "sharedLink": ""
    }
]